zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/include/stm32mp13xx_ll_bus.h
/**
  ******************************************************************************
  * @file    stm32mp13xx_ll_bus.h
  * @author  MCD Application Team
  * @version $VERSION$
  * @date    $DATE$
  * @brief   Header file of BUS LL module.

  @verbatim
                      ##### RCC Limitations #####
  ==============================================================================
    [..]
      A delay between an RCC peripheral clock enable and the effective peripheral
      enabling should be taken into account in order to manage the peripheral read/write
      from/to registers.
      (+) This delay depends on the peripheral mapping.
        (++) AHB & APB peripherals, 1 dummy read is necessary

    [..]
      Workarounds:
      (#) For AHB & APB peripherals, a dummy read to the peripheral register has been
          inserted in each LL_{BUS}_GRP{x}_EnableClock() function.

  @endverbatim
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32MP13xx_LL_BUS_H
#define STM32MP13xx_LL_BUS_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32mp13xx.h"

/** @addtogroup STM32MP13xx_LL_Driver
  * @{
  */

#if defined(RCC)

/** @defgroup BUS_LL BUS
  * @{
  */

/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/

/* Private constants ---------------------------------------------------------*/

/* Private macros ------------------------------------------------------------*/

/* Exported types ------------------------------------------------------------*/

/* Exported constants --------------------------------------------------------*/
/** @defgroup BUS_LL_Exported_Constants BUS Exported Constants
  * @{
  */

/** @defgroup BUS_LL_EC_AHB2_GRP1_PERIPH  AHB2 GRP1 PERIPH
  * @{
  */
#define LL_AHB2_GRP1_PERIPH_ALL            0x0001017FU
#define LL_AHB2_GRP1_PERIPH_DMA1           RCC_MP_AHB2ENSETR_DMA1EN
#define LL_AHB2_GRP1_PERIPH_DMA2           RCC_MP_AHB2ENSETR_DMA2EN
#define LL_AHB2_GRP1_PERIPH_DMAMUX1        RCC_MP_AHB2ENSETR_DMAMUX1EN
#define LL_AHB2_GRP1_PERIPH_DMA3           RCC_MP_AHB2ENSETR_DMA3EN
#define LL_AHB2_GRP1_PERIPH_DMAMUX2        RCC_MP_AHB2ENSETR_DMAMUX2EN
#define LL_AHB2_GRP1_PERIPH_ADC1           RCC_MP_AHB2ENSETR_ADC1EN
#define LL_AHB2_GRP1_PERIPH_ADC2           RCC_MP_AHB2ENSETR_ADC2EN
#define LL_AHB2_GRP1_PERIPH_USBO           RCC_MP_AHB2ENSETR_USBOEN
/**
  * @}
  */

/** @defgroup BUS_LL_EC_AHB4_GRP1_PERIPH  AHB4 GRP1 PERIPH
  * @{
  */
#define LL_AHB4_GRP1_PERIPH_ALL            0x000000FFU
#define LL_AHB4_GRP1_PERIPH_GPIOA          RCC_AHB4RSTSETR_GPIOARST
#define LL_AHB4_GRP1_PERIPH_GPIOB          RCC_AHB4RSTSETR_GPIOBRST
#define LL_AHB4_GRP1_PERIPH_GPIOC          RCC_AHB4RSTSETR_GPIOCRST
#define LL_AHB4_GRP1_PERIPH_GPIOD          RCC_AHB4RSTSETR_GPIODRST
#define LL_AHB4_GRP1_PERIPH_GPIOE          RCC_AHB4RSTSETR_GPIOERST
#define LL_AHB4_GRP1_PERIPH_GPIOF          RCC_AHB4RSTSETR_GPIOFRST
#define LL_AHB4_GRP1_PERIPH_GPIOG          RCC_AHB4RSTSETR_GPIOGRST
#define LL_AHB4_GRP1_PERIPH_GPIOH          RCC_AHB4RSTSETR_GPIOHRST
#define LL_AHB4_GRP1_PERIPH_GPIOI          RCC_AHB4RSTSETR_GPIOIRST
/**
  * @}
  */

/** @defgroup BUS_LL_EC_AHB4_S_GRP1_PERIPH  AHB4_S GRP1 PERIPH
  * @{
  */
#define LL_AHB4_S_GRP1_PERIPH_ALL          0x000000FFU
#define LL_AHB4_S_GRP1_PERIPH_GPIOA        RCC_MP_S_AHB4ENSETR_GPIOAEN
#define LL_AHB4_S_GRP1_PERIPH_GPIOB        RCC_MP_S_AHB4ENSETR_GPIOBEN
#define LL_AHB4_S_GRP1_PERIPH_GPIOC        RCC_MP_S_AHB4ENSETR_GPIOCEN
#define LL_AHB4_S_GRP1_PERIPH_GPIOD        RCC_MP_S_AHB4ENSETR_GPIODEN
#define LL_AHB4_S_GRP1_PERIPH_GPIOE        RCC_MP_S_AHB4ENSETR_GPIOEEN
#define LL_AHB4_S_GRP1_PERIPH_GPIOF        RCC_MP_S_AHB4ENSETR_GPIOFEN
#define LL_AHB4_S_GRP1_PERIPH_GPIOG        RCC_MP_S_AHB4ENSETR_GPIOGEN
#define LL_AHB4_S_GRP1_PERIPH_GPIOH        RCC_MP_S_AHB4ENSETR_GPIOHEN
#define LL_AHB4_S_GRP1_PERIPH_GPIOI        RCC_MP_S_AHB4ENSETR_GPIOIEN
/**
  * @}
  */

/** @defgroup BUS_LL_EC_AHB4_NS_GRP1_PERIPH  AHB4_NS GRP1 PERIPH
  * @{
  */
#define LL_AHB4_NS_GRP1_PERIPH_ALL         0x000000FFU
#define LL_AHB4_NS_GRP1_PERIPH_GPIOA       RCC_MP_NS_AHB4ENSETR_GPIOAEN
#define LL_AHB4_NS_GRP1_PERIPH_GPIOB       RCC_MP_NS_AHB4ENSETR_GPIOBEN
#define LL_AHB4_NS_GRP1_PERIPH_GPIOC       RCC_MP_NS_AHB4ENSETR_GPIOCEN
#define LL_AHB4_NS_GRP1_PERIPH_GPIOD       RCC_MP_NS_AHB4ENSETR_GPIODEN
#define LL_AHB4_NS_GRP1_PERIPH_GPIOE       RCC_MP_NS_AHB4ENSETR_GPIOEEN
#define LL_AHB4_NS_GRP1_PERIPH_GPIOF       RCC_MP_NS_AHB4ENSETR_GPIOFEN
#define LL_AHB4_NS_GRP1_PERIPH_GPIOG       RCC_MP_NS_AHB4ENSETR_GPIOGEN
#define LL_AHB4_NS_GRP1_PERIPH_GPIOH       RCC_MP_NS_AHB4ENSETR_GPIOHEN
#define LL_AHB4_NS_GRP1_PERIPH_GPIOI       RCC_MP_NS_AHB4ENSETR_GPIOIEN
/**
  * @}
  */

/** @defgroup BUS_LL_EC_AHB5_GRP1_PERIPH  AHB5 GRP1 PERIPH
  * @{
  */
/**
  * @note LL_AHB5_GRP1_PERIPH_ALL only contains reset values (not enable)
  */
#define LL_AHB5_GRP1_PERIPH_ALL            0x0001007CU
#define LL_AHB5_GRP1_PERIPH_PKA            RCC_MP_AHB5ENSETR_PKAEN
#define LL_AHB5_GRP1_PERIPH_SAES           RCC_MP_AHB5ENSETR_SAESEN
#define LL_AHB5_GRP1_PERIPH_CRYP1          RCC_MP_AHB5ENSETR_CRYP1EN
#define LL_AHB5_GRP1_PERIPH_HASH1          RCC_MP_AHB5ENSETR_HASH1EN
#define LL_AHB5_GRP1_PERIPH_RNG1           RCC_MP_AHB5ENSETR_RNG1EN
#define LL_AHB5_GRP1_PERIPH_BKPSRAM        RCC_MP_AHB5ENSETR_BKPSRAMEN
#define LL_AHB5_GRP1_PERIPH_AXIMC          RCC_MP_AHB5ENSETR_AXIMCEN
/**
  * @}
  */

/** @defgroup BUS_LL_EC_AHB6_GRP1_PERIPH  AHB6 GRP1 PERIPH
  * @{
  */
#define LL_AHB6_GRP1_PERIPH_ALL            0xF9135F82U
#define LL_AHB6_GRP1_PERIPH_MCE            RCC_MP_AHB6ENSETR_MCEEN
#define LL_AHB6_GRP1_PERIPH_ETH1CK         RCC_MP_AHB6ENSETR_ETH1CKEN
#define LL_AHB6_GRP1_PERIPH_ETH1TX         RCC_MP_AHB6ENSETR_ETH1TXEN
#define LL_AHB6_GRP1_PERIPH_ETH1RX         RCC_MP_AHB6ENSETR_ETH1RXEN
#define LL_AHB6_GRP1_PERIPH_ETH1MAC        RCC_MP_AHB6ENSETR_ETH1MACEN
#define LL_AHB6_GRP1_PERIPH_ETH1STP        RCC_MP_AHB6LPENSETR_ETH1STPEN
#define LL_AHB6_GRP1_PERIPH_FMC            RCC_MP_AHB6ENSETR_FMCEN
#define LL_AHB6_GRP1_PERIPH_QSPI           RCC_MP_AHB6ENSETR_QSPIEN
#define LL_AHB6_GRP1_PERIPH_SDMMC1         RCC_MP_AHB6ENSETR_SDMMC1EN
#define LL_AHB6_GRP1_PERIPH_SDMMC2         RCC_MP_AHB6ENSETR_SDMMC2EN
#define LL_AHB6_GRP1_PERIPH_CRC1           RCC_MP_AHB6ENSETR_CRC1EN
#define LL_AHB6_GRP1_PERIPH_USBH           RCC_MP_AHB6ENSETR_USBHEN
#define LL_AHB6_GRP1_PERIPH_ETH2CK         RCC_MP_AHB6ENSETR_ETH2CKEN
#define LL_AHB6_GRP1_PERIPH_ETH2TX         RCC_MP_AHB6ENSETR_ETH2TXEN
#define LL_AHB6_GRP1_PERIPH_ETH2RX         RCC_MP_AHB6ENSETR_ETH2RXEN
#define LL_AHB6_GRP1_PERIPH_ETH2MAC        RCC_MP_AHB6ENSETR_ETH2MACEN
#define LL_AHB6_GRP1_PERIPH_ETH2STP        RCC_MP_AHB6LPENSETR_ETH2STPEN
/**
  * @}
  */

/** @defgroup BUS_LL_EC_AHB6_S_GRP1_PERIPH  AHB6_S GRP1 PERIPH
  * @{
  */

#define LL_AHB6_S_GRP1_PERIPH_MDMA         RCC_MP_S_AHB6ENSETR_MDMAEN
/**
  * @}
  */

