zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/include/stm32mp13xx_ll_bus.h
/** @defgroup BUS_LL_EC_AHB6_NS_GRP1_PERIPH  AHB6_NS GRP1 PERIPH
  * @{
  */

#define LL_AHB6_NS_GRP1_PERIPH_MDMA        RCC_MP_S_AHB6ENSETR_MDMAEN
/**
  * @}
  */

/** @defgroup BUS_LL_EC_AXI_GRP1_PERIPH  AXI GRP1 PERIPH
  * @{
  */
#define LL_AXI_GRP1_PERIPH_ALL             0x00000001U
#define LL_AXI_S_GRP1_PERIPH_SYSRAMLPEN    RCC_MP_S_AXIMLPENSETR_SYSRAMLPEN
#define LL_AXI_NS_GRP1_PERIPH_SYSRAMLPEN   RCC_MP_NS_AXIMLPENSETR_SYSRAMLPEN
/**
  * @}
  */

/** @defgroup BUS_LL_EC_MLAHB_GRP1_PERIPH  MLAHB GRP1 PERIPH
  * @{
  */
#define LL_MLAHB_GRP1_PERIPH_ALL           0x00000010U
#define LL_MLAHB_GRP1_PERIPH_SRAM1LPEN     RCC_MP_MLAHBLPENSETR_SRAM1LPEN
#define LL_MLAHB_GRP1_PERIPH_SRAM2LPEN     RCC_MP_MLAHBLPENSETR_SRAM2LPEN
#define LL_MLAHB_GRP1_PERIPH_SRAM3LPEN     RCC_MP_MLAHBLPENSETR_SRAM3LPEN
/**
  * @}
  */

/** @defgroup BUS_LL_EC_APB1_GRP1_PERIPH  APB1 GRP1 PERIPH
  * @{
  */
#define LL_APB1_GRP1_PERIPH_ALL            0x046F9A3FU
#define LL_APB1_GRP1_PERIPH_TIM2           RCC_MP_APB1ENSETR_TIM2EN
#define LL_APB1_GRP1_PERIPH_TIM3           RCC_MP_APB1ENSETR_TIM3EN
#define LL_APB1_GRP1_PERIPH_TIM4           RCC_MP_APB1ENSETR_TIM4EN
#define LL_APB1_GRP1_PERIPH_TIM5           RCC_MP_APB1ENSETR_TIM5EN
#define LL_APB1_GRP1_PERIPH_TIM6           RCC_MP_APB1ENSETR_TIM6EN
#define LL_APB1_GRP1_PERIPH_TIM7           RCC_MP_APB1ENSETR_TIM7EN
#define LL_APB1_GRP1_PERIPH_LPTIM1         RCC_MP_APB1ENSETR_LPTIM1EN
#define LL_APB1_GRP1_PERIPH_SPI2           RCC_MP_APB1ENSETR_SPI2EN
#define LL_APB1_GRP1_PERIPH_SPI3           RCC_MP_APB1ENSETR_SPI3EN
#define LL_APB1_GRP1_PERIPH_USART3         RCC_MP_APB1ENSETR_USART3EN
#define LL_APB1_GRP1_PERIPH_UART4          RCC_MP_APB1ENSETR_UART4EN
#define LL_APB1_GRP1_PERIPH_UART5          RCC_MP_APB1ENSETR_UART5EN
#define LL_APB1_GRP1_PERIPH_UART7          RCC_MP_APB1ENSETR_UART7EN
#define LL_APB1_GRP1_PERIPH_UART8          RCC_MP_APB1ENSETR_UART8EN
#define LL_APB1_GRP1_PERIPH_I2C1           RCC_MP_APB1ENSETR_I2C1EN
#define LL_APB1_GRP1_PERIPH_I2C2           RCC_MP_APB1ENSETR_I2C2EN
#define LL_APB1_GRP1_PERIPH_SPDIF          RCC_MP_APB1ENSETR_SPDIFEN
/**
  * @}
  */

/** @defgroup BUS_LL_EC_APB2_GRP1_PERIPH  APB2 GRP1 PERIPH
  * @{
  */
/**
  * @note LL_APB2_GRP1_PERIPH_ALL only contains reset values (not enable)
  */
#define LL_APB2_GRP1_PERIPH_ALL            0x01132103U
#define LL_APB2_GRP1_PERIPH_TIM1           RCC_MP_APB2ENSETR_TIM1EN
#define LL_APB2_GRP1_PERIPH_TIM8           RCC_MP_APB2ENSETR_TIM8EN
#define LL_APB2_GRP1_PERIPH_SPI1           RCC_MP_APB2ENSETR_SPI1EN
#define LL_APB2_GRP1_PERIPH_USART6         RCC_MP_APB2ENSETR_USART6EN
#define LL_APB2_GRP1_PERIPH_SAI1           RCC_MP_APB2ENSETR_SAI1EN
#define LL_APB2_GRP1_PERIPH_SAI2           RCC_MP_APB2ENSETR_SAI2EN
#define LL_APB2_GRP1_PERIPH_DFSDM1         RCC_MP_APB2ENSETR_DFSDMEN
#define LL_APB2_GRP1_PERIPH_ADFSDM1        RCC_MP_APB2ENSETR_ADFSDMEN
#define LL_APB2_GRP1_PERIPH_FDCAN          RCC_MP_APB2ENSETR_FDCANEN
/**
  * @}
  */

/** @defgroup BUS_LL_EC_APB3_GRP1_PERIPH  APB3 GRP1 PERIPH
  * @{
  */
/**
  * @note LL_APB3_GRP1_PERIPH_ALL only contains reset values (not enable)
  */
#define LL_APB3_GRP1_PERIPH_ALL            0x0001280FU
#define LL_APB3_GRP1_PERIPH_LPTIM2         RCC_MP_APB3ENSETR_LPTIM2EN
#define LL_APB3_GRP1_PERIPH_LPTIM3         RCC_MP_APB3ENSETR_LPTIM3EN
#define LL_APB3_GRP1_PERIPH_LPTIM4         RCC_MP_APB3ENSETR_LPTIM4EN
#define LL_APB3_GRP1_PERIPH_LPTIM5         RCC_MP_APB3ENSETR_LPTIM5EN
#define LL_APB3_GRP1_PERIPH_SYSCFG         RCC_APB3RSTCLRR_SYSCFGRST
#define LL_APB3_GRP1_PERIPH_VREF           RCC_MP_APB3ENSETR_VREFEN
#define LL_APB3_GRP1_PERIPH_TMPSENS        RCC_MP_APB3ENSETR_DTSEN
#define LL_APB3_GRP1_PERIPH_HDP            RCC_MP_APB3ENSETR_HDPEN
/**
  * @}
  */

/** @defgroup BUS_LL_EC_APB3_S_GRP1_PERIPH  APB3_S GRP1 PERIPH
  * @{
  */
/**
  * @note LL_APB3_S_GRP1_PERIPH_ALL only contains reset values (not enable)
  */
#define LL_APB3_S_GRP1_PERIPH_ALL          0x00000001U
#define LL_APB3_S_GRP1_PERIPH_SYSCFG       RCC_MP_S_APB3ENSETR_SYSCFGEN
/**
  * @}
  */

/** @defgroup BUS_LL_EC_APB3_NS_GRP1_PERIPH  APB3_NS GRP1 PERIPH
  * @{
  */
/**
  * @note LL_APB3_NS_GRP1_PERIPH_ALL only contains reset values (not enable)
  */
#define LL_APB3_NS_GRP1_PERIPH_ALL         0x00000001U
#define LL_APB3_NS_GRP1_PERIPH_SYSCFG      RCC_MP_NS_APB3ENSETR_SYSCFGEN
/**
  * @}
  */

/** @defgroup BUS_LL_EC_APB4_GRP1_PERIPH  APB4 GRP1 PERIPH
  * @{
  */
/**
  * @note LL_APB4_GRP1_PERIPH_ALL only contains reset values (not enable)
  */
#define LL_APB4_GRP1_PERIPH_ALL            0x00010103U
#define LL_APB4_GRP1_PERIPH_DCMIPP         RCC_MP_APB4ENSETR_DCMIPPEN
#define LL_APB4_GRP1_PERIPH_DDRPERFM       RCC_MP_APB4ENSETR_DDRPERFMEN
#define LL_APB4_GRP1_PERIPH_IWDG2          RCC_MP_APB4ENSETR_IWDG2APBEN
#define LL_APB4_GRP1_PERIPH_USBPHY         RCC_MP_APB4ENSETR_USBPHYEN
#define LL_APB4_GRP1_PERIPH_STGENRO        RCC_MP_APB4ENSETR_STGENROEN
#define LL_APB4_GRP1_PERIPH_STGENROSTP     RCC_MP_APB4LPENSETR_STGENROSTPEN
/**
  * @}
  */

/** @defgroup BUS_LL_EC_APB4_S_GRP1_PERIPH  APB4_S GRP1 PERIPH
  * @{
  */
/**
  * @note LL_APB4_S_GRP1_PERIPH_ALL only contains reset values (not enable)
  */
#define LL_APB4_S_GRP1_PERIPH_ALL          0x00000001U
#define LL_APB4_S_GRP1_PERIPH_LTDC         RCC_MP_S_APB4ENSETR_LTDCEN
/**
  * @}
  */

/** @defgroup BUS_LL_EC_APB4_NS_GRP1_PERIPH  APB4_NS GRP1 PERIPH
  * @{
  */
/**
  * @note LL_APB4_NS_GRP1_PERIPH_ALL only contains reset values (not enable)
  */
#define LL_APB4_NS_GRP1_PERIPH_ALL         0x00000001U
#define LL_APB4_NS_GRP1_PERIPH_LTDC        RCC_MP_NS_APB4ENSETR_LTDCEN
/**
  * @}
  */

/** @defgroup BUS_LL_EC_APB5_GRP1_PERIPH  APB5 GRP1 PERIPH
  * @{
  */
/**
  * @note LL_APB5_GRP1_PERIPH_ALL only contains reset values (not enable)
  */
#define LL_APB5_GRP1_PERIPH_ALL            0x0031A900U
#define LL_APB5_GRP1_PERIPH_RTCAPB         RCC_MP_APB5ENSETR_RTCAPBEN
#define LL_APB5_GRP1_PERIPH_TZC            RCC_MP_APB5ENSETR_TZCEN
#define LL_APB5_GRP1_PERIPH_ETZPC          RCC_MP_APB5ENSETR_ETZPCEN
#define LL_APB5_GRP1_PERIPH_IWDG1          RCC_MP_APB5ENSETR_IWDG1APBEN
#define LL_APB5_GRP1_PERIPH_BSEC           RCC_MP_APB5ENSETR_BSECEN
#define LL_APB5_GRP1_PERIPH_STGEN          RCC_MP_APB5ENSETR_STGENCEN
#define LL_APB5_GRP1_PERIPH_STGENSTP       RCC_MP_APB5LPENSETR_STGENCSTPEN
/**
  * @}
  */

