zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/include/stm32mp13xx_ll_bus.h
/** @defgroup BUS_LL_EC_APB6_GRP1_PERIPH  APB6 GRP1 PERIPH
  * @{
  */
/**
  * @note LL_APB6_GRP1_PERIPH_ALL only contains reset values (not enable)
  */
#define LL_APB6_GRP1_PERIPH_ALL            0x00001FFFU
#define LL_APB6_GRP1_PERIPH_USART1         RCC_MP_APB6ENSETR_USART1EN
#define LL_APB6_GRP1_PERIPH_USART2         RCC_MP_APB6ENSETR_USART2EN
#define LL_APB6_GRP1_PERIPH_SPI4           RCC_MP_APB6ENSETR_SPI4EN
#define LL_APB6_GRP1_PERIPH_SPI5           RCC_MP_APB6ENSETR_SPI5EN
#define LL_APB6_GRP1_PERIPH_I2C3           RCC_MP_APB6ENSETR_I2C3EN
#define LL_APB6_GRP1_PERIPH_I2C4           RCC_MP_APB6ENSETR_I2C4EN
#define LL_APB6_GRP1_PERIPH_I2C5           RCC_MP_APB6ENSETR_I2C5EN
#define LL_APB6_GRP1_PERIPH_TIM12          RCC_MP_APB6ENSETR_TIM12EN
#define LL_APB6_GRP1_PERIPH_TIM13          RCC_MP_APB6ENSETR_TIM13EN
#define LL_APB6_GRP1_PERIPH_TIM14          RCC_MP_APB6ENSETR_TIM14EN
#define LL_APB6_GRP1_PERIPH_TIM15          RCC_MP_APB6ENSETR_TIM15EN
#define LL_APB6_GRP1_PERIPH_TIM16          RCC_MP_APB6ENSETR_TIM16EN
#define LL_APB6_GRP1_PERIPH_TIM17          RCC_MP_APB6ENSETR_TIM17EN
/**
  * @}
  */

/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/
/* Exported functions --------------------------------------------------------*/
/** @defgroup BUS_LL_Exported_Functions BUS Exported Functions
  * @{
  */

/** @defgroup BUS_LL_EF_AHB2 AHB2
  * @{
  */

/**
  * @brief  Enable AHB2 peripherals clock.
  * @rmtoll MP_AHB2ENSETR      DMA1          LL_AHB2_GRP1_EnableClock\n
  *         MP_AHB2ENSETR      DMA2          LL_AHB2_GRP1_EnableClock\n
  *         MP_AHB2ENSETR      DMAMUX1       LL_AHB2_GRP1_EnableClock\n
  *         MP_AHB2ENSETR      DMA3          LL_AHB2_GRP1_EnableClock\n
  *         MP_AHB2ENSETR      DMAMUX2       LL_AHB2_GRP1_EnableClock\n
  *         MP_AHB2ENSETR      ADC1          LL_AHB2_GRP1_EnableClock\n
  *         MP_AHB2ENSETR      ADC2          LL_AHB2_GRP1_EnableClock\n
  *         MP_AHB2ENSETR      USBO          LL_AHB2_GRP1_EnableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB2_GRP1_PERIPH_DMA1
  *         @arg @ref LL_AHB2_GRP1_PERIPH_DMA2
  *         @arg @ref LL_AHB2_GRP1_PERIPH_DMAMUX1
  *         @arg @ref LL_AHB2_GRP1_PERIPH_DMA3
  *         @arg @ref LL_AHB2_GRP1_PERIPH_DMAMUX2
  *         @arg @ref LL_AHB2_GRP1_PERIPH_ADC1
  *         @arg @ref LL_AHB2_GRP1_PERIPH_ADC2
  *         @arg @ref LL_AHB2_GRP1_PERIPH_USBO
  * @retval None
  */
__STATIC_INLINE void LL_AHB2_GRP1_EnableClock(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  WRITE_REG(RCC->MP_AHB2ENSETR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->MP_AHB2ENSETR, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Check if AHB2 peripheral clock is enabled or not
  * @rmtoll MP_AHB2ENSETR      DMA1          LL_AHB2_GRP1_IsEnabledClock\n
  *         MP_AHB2ENSETR      DMA2          LL_AHB2_GRP1_IsEnabledClock\n
  *         MP_AHB2ENSETR      DMAMUX1       LL_AHB2_GRP1_IsEnabledClock\n
  *         MP_AHB2ENSETR      DMA3          LL_AHB2_GRP1_IsEnabledClock\n
  *         MP_AHB2ENSETR      DMAMUX2       LL_AHB2_GRP1_IsEnabledClock\n
  *         MP_AHB2ENSETR      ADC1          LL_AHB2_GRP1_IsEnabledClock\n
  *         MP_AHB2ENSETR      ADC2          LL_AHB2_GRP1_IsEnabledClock\n
  *         MP_AHB2ENSETR      USBO          LL_AHB2_GRP1_IsEnabledClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB2_GRP1_PERIPH_DMA1
  *         @arg @ref LL_AHB2_GRP1_PERIPH_DMA2
  *         @arg @ref LL_AHB2_GRP1_PERIPH_DMAMUX1
  *         @arg @ref LL_AHB2_GRP1_PERIPH_DMA3
  *         @arg @ref LL_AHB2_GRP1_PERIPH_DMAMUX2
  *         @arg @ref LL_AHB2_GRP1_PERIPH_ADC1
  *         @arg @ref LL_AHB2_GRP1_PERIPH_ADC2
  *         @arg @ref LL_AHB2_GRP1_PERIPH_USBO
  * @retval State of Periphs (1 or 0).
  */
__STATIC_INLINE uint32_t LL_AHB2_GRP1_IsEnabledClock(uint32_t Periphs)
{
  return ((READ_BIT(RCC->MP_AHB2ENSETR, Periphs) == Periphs) ? 1U : 0U);
}

/**
  * @brief  Disable AHB2 peripherals clock.
  * @rmtoll MP_AHB2ENCLRR      DMA1          LL_AHB2_GRP1_DisableClock\n
  *         MP_AHB2ENCLRR      DMA2          LL_AHB2_GRP1_DisableClock\n
  *         MP_AHB2ENCLRR      DMAMUX1       LL_AHB2_GRP1_DisableClock\n
  *         MP_AHB2ENCLRR      DMA3          LL_AHB2_GRP1_DisableClock\n
  *         MP_AHB2ENCLRR      DMAMUX2       LL_AHB2_GRP1_DisableClock\n
  *         MP_AHB2ENCLRR      ADC1          LL_AHB2_GRP1_DisableClock\n
  *         MP_AHB2ENCLRR      ADC2          LL_AHB2_GRP1_DisableClock\n
  *         MP_AHB2ENCLRR      USBO          LL_AHB2_GRP1_DisableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB2_GRP1_PERIPH_DMA1
  *         @arg @ref LL_AHB2_GRP1_PERIPH_DMA2
  *         @arg @ref LL_AHB2_GRP1_PERIPH_DMAMUX1
  *         @arg @ref LL_AHB2_GRP1_PERIPH_DMA3
  *         @arg @ref LL_AHB2_GRP1_PERIPH_DMAMUX2
  *         @arg @ref LL_AHB2_GRP1_PERIPH_ADC1
  *         @arg @ref LL_AHB2_GRP1_PERIPH_ADC2
  *         @arg @ref LL_AHB2_GRP1_PERIPH_USBO
  * @retval None
  */
__STATIC_INLINE void LL_AHB2_GRP1_DisableClock(uint32_t Periphs)
{
  WRITE_REG(RCC->MP_AHB2ENCLRR, Periphs);
}

/**
  * @brief  Force AHB2 peripherals reset.
  * @rmtoll AHB2RSTSETR      DMA1          LL_AHB2_GRP1_ForceReset\n
  *         AHB2RSTSETR      DMA2          LL_AHB2_GRP1_ForceReset\n
  *         AHB2RSTSETR      DMAMUX1       LL_AHB2_GRP1_ForceReset\n
  *         AHB2RSTSETR      DMA3          LL_AHB2_GRP1_ForceReset\n
  *         AHB2RSTSETR      DMAMUX2       LL_AHB2_GRP1_ForceReset\n
  *         AHB2RSTSETR      ADC1          LL_AHB2_GRP1_ForceReset\n
  *         AHB2RSTSETR      ADC2          LL_AHB2_GRP1_ForceReset\n
  *         AHB2RSTSETR      USBO          LL_AHB2_GRP1_ForceReset
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB2_GRP1_PERIPH_ALL
  *         @arg @ref LL_AHB2_GRP1_PERIPH_DMA1
  *         @arg @ref LL_AHB2_GRP1_PERIPH_DMA2
  *         @arg @ref LL_AHB2_GRP1_PERIPH_DMAMUX1
  *         @arg @ref LL_AHB2_GRP1_PERIPH_DMA3
  *         @arg @ref LL_AHB2_GRP1_PERIPH_DMAMUX2
  *         @arg @ref LL_AHB2_GRP1_PERIPH_ADC1
  *         @arg @ref LL_AHB2_GRP1_PERIPH_ADC2
  *         @arg @ref LL_AHB2_GRP1_PERIPH_USBO
  * @retval None
  */
__STATIC_INLINE void LL_AHB2_GRP1_ForceReset(uint32_t Periphs)
{
  WRITE_REG(RCC->AHB2RSTSETR, Periphs);
}

/**
  * @brief  Release AHB2 peripherals reset.
  * @rmtoll AHB2RSTCLRR      DMA1          LL_AHB2_GRP1_ReleaseReset\n
  *         AHB2RSTCLRR      DMA2          LL_AHB2_GRP1_ReleaseReset\n
  *         AHB2RSTCLRR      DMAMUX1       LL_AHB2_GRP1_ReleaseReset\n
  *         AHB2RSTCLRR      DMA3          LL_AHB2_GRP1_ReleaseReset\n
  *         AHB2RSTCLRR      DMAMUX2       LL_AHB2_GRP1_ReleaseReset\n
  *         AHB2RSTCLRR      ADC1          LL_AHB2_GRP1_ReleaseReset\n
  *         AHB2RSTCLRR      ADC2          LL_AHB2_GRP1_ReleaseReset\n
  *         AHB2RSTCLRR      USBO          LL_AHB2_GRP1_ReleaseReset
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB2_GRP1_PERIPH_ALL
  *         @arg @ref LL_AHB2_GRP1_PERIPH_DMA1
  *         @arg @ref LL_AHB2_GRP1_PERIPH_DMA2
  *         @arg @ref LL_AHB2_GRP1_PERIPH_DMAMUX1
  *         @arg @ref LL_AHB2_GRP1_PERIPH_DMA3
  *         @arg @ref LL_AHB2_GRP1_PERIPH_DMAMUX2
  *         @arg @ref LL_AHB2_GRP1_PERIPH_ADC1
  *         @arg @ref LL_AHB2_GRP1_PERIPH_ADC2
  *         @arg @ref LL_AHB2_GRP1_PERIPH_USBO
  * @retval None
  */
__STATIC_INLINE void LL_AHB2_GRP1_ReleaseReset(uint32_t Periphs)
{
  WRITE_REG(RCC->AHB2RSTCLRR, Periphs);
}

/**
  * @brief  Enable AHB2 peripheral clocks in Sleep mode
  * @rmtoll MP_AHB2LPENSETR      DMA1          LL_AHB2_GRP1_EnableClockSleep\n
  *         MP_AHB2LPENSETR      DMA2          LL_AHB2_GRP1_EnableClockSleep\n
  *         MP_AHB2LPENSETR      DMAMUX1       LL_AHB2_GRP1_EnableClockSleep\n
  *         MP_AHB2LPENSETR      DMA3          LL_AHB2_GRP1_EnableClockSleep\n
  *         MP_AHB2LPENSETR      DMAMUX2       LL_AHB2_GRP1_EnableClockSleep\n
  *         MP_AHB2LPENSETR      ADC1          LL_AHB2_GRP1_EnableClockSleep\n
  *         MP_AHB2LPENSETR      ADC2          LL_AHB2_GRP1_EnableClockSleep\n
  *         MP_AHB2LPENSETR      USBO          LL_AHB2_GRP1_EnableClockSleep
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB2_GRP1_PERIPH_DMA1
  *         @arg @ref LL_AHB2_GRP1_PERIPH_DMA2
  *         @arg @ref LL_AHB2_GRP1_PERIPH_DMAMUX1
  *         @arg @ref LL_AHB2_GRP1_PERIPH_DMA3
  *         @arg @ref LL_AHB2_GRP1_PERIPH_DMAMUX2
  *         @arg @ref LL_AHB2_GRP1_PERIPH_ADC1
  *         @arg @ref LL_AHB2_GRP1_PERIPH_ADC2
  *         @arg @ref LL_AHB2_GRP1_PERIPH_USBO
  * @retval None
  */
__STATIC_INLINE void LL_AHB2_GRP1_EnableClockSleep(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  WRITE_REG(RCC->MP_AHB2LPENSETR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->MP_AHB2LPENSETR, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Disable AHB2 peripheral clocks in Sleep mode
  * @rmtoll MP_AHB2LPENCLRR      DMA1          LL_AHB2_GRP1_DisableClockSleep\n
  *         MP_AHB2LPENCLRR      DMA2          LL_AHB2_GRP1_DisableClockSleep\n
  *         MP_AHB2LPENCLRR      DMAMUX1       LL_AHB2_GRP1_DisableClockSleep\n
  *         MP_AHB2LPENCLRR      DMA3          LL_AHB2_GRP1_DisableClockSleep\n
  *         MP_AHB2LPENCLRR      DMAMUX2       LL_AHB2_GRP1_DisableClockSleep\n
  *         MP_AHB2LPENCLRR      ADC1          LL_AHB2_GRP1_DisableClockSleep\n
  *         MP_AHB2LPENCLRR      ADC2          LL_AHB2_GRP1_DisableClockSleep\n
  *         MP_AHB2LPENCLRR      USBO          LL_AHB2_GRP1_DisableClockSleep
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB2_GRP1_PERIPH_DMA1
  *         @arg @ref LL_AHB2_GRP1_PERIPH_DMA2
  *         @arg @ref LL_AHB2_GRP1_PERIPH_DMAMUX1
  *         @arg @ref LL_AHB2_GRP1_PERIPH_DMA3
  *         @arg @ref LL_AHB2_GRP1_PERIPH_DMAMUX2
  *         @arg @ref LL_AHB2_GRP1_PERIPH_ADC1
  *         @arg @ref LL_AHB2_GRP1_PERIPH_ADC2
  *         @arg @ref LL_AHB2_GRP1_PERIPH_USBO
  * @retval None
  */
__STATIC_INLINE void LL_AHB2_GRP1_DisableClockSleep(uint32_t Periphs)
{
  WRITE_REG(RCC->MP_AHB2LPENCLRR, Periphs);
}
/**
  * @}
  */

