zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/include/stm32mp13xx_ll_bus.h
/** @defgroup BUS_LL_EF_AHB4 AHB4
  * @{
  */

/**
  * @brief  Force AHB4 peripherals reset.
  * @rmtoll AHB4RSTSETR     GPIOA       LL_AHB4_GRP1_ForceReset\n
  *         AHB4RSTSETR     GPIOB       LL_AHB4_GRP1_ForceReset\n
  *         AHB4RSTSETR     GPIOC       LL_AHB4_GRP1_ForceReset\n
  *         AHB4RSTSETR     GPIOD       LL_AHB4_GRP1_ForceReset\n
  *         AHB4RSTSETR     GPIOE       LL_AHB4_GRP1_ForceReset\n
  *         AHB4RSTSETR     GPIOF       LL_AHB4_GRP1_ForceReset\n
  *         AHB4RSTSETR     GPIOG       LL_AHB4_GRP1_ForceReset\n
  *         AHB4RSTSETR     GPIOH       LL_AHB4_GRP1_ForceReset\n
  *         AHB4RSTSETR     GPIOI       LL_AHB4_GRP1_ForceReset
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB4_GRP1_PERIPH_ALL
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOA
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOB
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOC
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOD
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOE
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOF
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOG
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOH
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOI
  * @retval None
  */
__STATIC_INLINE void LL_AHB4_GRP1_ForceReset(uint32_t Periphs)
{
  WRITE_REG(RCC->AHB4RSTSETR, Periphs);
}

/**
  * @brief  Release AHB4 peripherals reset.
  * @rmtoll AHB4RSTCLRR     GPIOA       LL_AHB4_GRP1_ReleaseReset\n
  *         AHB4RSTCLRR     GPIOB       LL_AHB4_GRP1_ReleaseReset\n
  *         AHB4RSTCLRR     GPIOC       LL_AHB4_GRP1_ReleaseReset\n
  *         AHB4RSTCLRR     GPIOD       LL_AHB4_GRP1_ReleaseReset\n
  *         AHB4RSTCLRR     GPIOE       LL_AHB4_GRP1_ReleaseReset\n
  *         AHB4RSTCLRR     GPIOF       LL_AHB4_GRP1_ReleaseReset\n
  *         AHB4RSTCLRR     GPIOG       LL_AHB4_GRP1_ReleaseReset\n
  *         AHB4RSTCLRR     GPIOH       LL_AHB4_GRP1_ReleaseReset\n
  *         AHB4RSTCLRR     GPIOI       LL_AHB4_GRP1_ReleaseReset
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB4_GRP1_PERIPH_ALL
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOA
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOB
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOC
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOD
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOE
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOF
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOG
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOH
  *         @arg @ref LL_AHB4_GRP1_PERIPH_GPIOI
  * @retval None
  */
__STATIC_INLINE void LL_AHB4_GRP1_ReleaseReset(uint32_t Periphs)
{
  WRITE_REG(RCC->AHB4RSTCLRR, Periphs);
}
/**
  * @}
  */

/** @defgroup BUS_LL_EF_AHB4_S AHB4_S
  * @{
  */

/**
  * @brief  Enable secure AHB4 peripherals clock.
  * @rmtoll MP_S_AHB4ENSETR      GPIOA       LL_AHB4_S_GRP1_EnableClock\n
  *         MP_S_AHB4ENSETR      GPIOB       LL_AHB4_S_GRP1_EnableClock\n
  *         MP_S_AHB4ENSETR      GPIOC       LL_AHB4_S_GRP1_EnableClock\n
  *         MP_S_AHB4ENSETR      GPIOD       LL_AHB4_S_GRP1_EnableClock\n
  *         MP_S_AHB4ENSETR      GPIOE       LL_AHB4_S_GRP1_EnableClock\n
  *         MP_S_AHB4ENSETR      GPIOF       LL_AHB4_S_GRP1_EnableClock\n
  *         MP_S_AHB4ENSETR      GPIOG       LL_AHB4_S_GRP1_EnableClock\n
  *         MP_S_AHB4ENSETR      GPIOH       LL_AHB4_S_GRP1_EnableClock\n
  *         MP_S_AHB4ENSETR      GPIOI       LL_AHB4_S_GRP1_EnableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB4_S_GRP1_PERIPH_GPIOA
  *         @arg @ref LL_AHB4_S_GRP1_PERIPH_GPIOB
  *         @arg @ref LL_AHB4_S_GRP1_PERIPH_GPIOC
  *         @arg @ref LL_AHB4_S_GRP1_PERIPH_GPIOD
  *         @arg @ref LL_AHB4_S_GRP1_PERIPH_GPIOE
  *         @arg @ref LL_AHB4_S_GRP1_PERIPH_GPIOF
  *         @arg @ref LL_AHB4_S_GRP1_PERIPH_GPIOG
  *         @arg @ref LL_AHB4_S_GRP1_PERIPH_GPIOH
  *         @arg @ref LL_AHB4_S_GRP1_PERIPH_GPIOI
  * @retval None
  */
__STATIC_INLINE void LL_AHB4_S_GRP1_EnableClock(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  WRITE_REG(RCC->MP_S_AHB4ENSETR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->MP_S_AHB4ENSETR, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Check if secure AHB4 peripheral clock is enabled or not
  * @rmtoll MP_S_AHB4ENSETR      GPIOA       LL_AHB4_S_GRP1_IsEnabledClock\n
  *         MP_S_AHB4ENSETR      GPIOB       LL_AHB4_S_GRP1_IsEnabledClock\n
  *         MP_S_AHB4ENSETR      GPIOC       LL_AHB4_S_GRP1_IsEnabledClock\n
  *         MP_S_AHB4ENSETR      GPIOD       LL_AHB4_S_GRP1_IsEnabledClock\n
  *         MP_S_AHB4ENSETR      GPIOE       LL_AHB4_S_GRP1_IsEnabledClock\n
  *         MP_S_AHB4ENSETR      GPIOF       LL_AHB4_S_GRP1_IsEnabledClock\n
  *         MP_S_AHB4ENSETR      GPIOG       LL_AHB4_S_GRP1_IsEnabledClock\n
  *         MP_S_AHB4ENSETR      GPIOH       LL_AHB4_S_GRP1_IsEnabledClock\n
  *         MP_S_AHB4ENSETR      GPIOI       LL_AHB4_S_GRP1_IsEnabledClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB4_S_GRP1_PERIPH_GPIOA
  *         @arg @ref LL_AHB4_S_GRP1_PERIPH_GPIOB
  *         @arg @ref LL_AHB4_S_GRP1_PERIPH_GPIOC
  *         @arg @ref LL_AHB4_S_GRP1_PERIPH_GPIOD
  *         @arg @ref LL_AHB4_S_GRP1_PERIPH_GPIOE
  *         @arg @ref LL_AHB4_S_GRP1_PERIPH_GPIOF
  *         @arg @ref LL_AHB4_S_GRP1_PERIPH_GPIOG
  *         @arg @ref LL_AHB4_S_GRP1_PERIPH_GPIOH
  *         @arg @ref LL_AHB4_S_GRP1_PERIPH_GPIOI
  * @retval State of Periphs (1 or 0).
  */
__STATIC_INLINE uint32_t LL_AHB4_S_GRP1_IsEnabledClock(uint32_t Periphs)
{
  return ((READ_BIT(RCC->MP_S_AHB4ENSETR, Periphs) == Periphs) ? 1U : 0U);
}

/**
  * @brief  Disable secure AHB4 peripherals clock.
  * @rmtoll MP_S_AHB4ENCLRR      GPIOA       LL_AHB4_S_GRP1_DisableClock\n
  *         MP_S_AHB4ENCLRR      GPIOB       LL_AHB4_S_GRP1_DisableClock\n
  *         MP_S_AHB4ENCLRR      GPIOC       LL_AHB4_S_GRP1_DisableClock\n
  *         MP_S_AHB4ENCLRR      GPIOD       LL_AHB4_S_GRP1_DisableClock\n
  *         MP_S_AHB4ENCLRR      GPIOE       LL_AHB4_S_GRP1_DisableClock\n
  *         MP_S_AHB4ENCLRR      GPIOF       LL_AHB4_S_GRP1_DisableClock\n
  *         MP_S_AHB4ENCLRR      GPIOG       LL_AHB4_S_GRP1_DisableClock\n
  *         MP_S_AHB4ENCLRR      GPIOH       LL_AHB4_S_GRP1_DisableClock\n
  *         MP_S_AHB4ENCLRR      GPIOI       LL_AHB4_S_GRP1_DisableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB4_S_GRP1_PERIPH_GPIOA
  *         @arg @ref LL_AHB4_S_GRP1_PERIPH_GPIOB
  *         @arg @ref LL_AHB4_S_GRP1_PERIPH_GPIOC
  *         @arg @ref LL_AHB4_S_GRP1_PERIPH_GPIOD
  *         @arg @ref LL_AHB4_S_GRP1_PERIPH_GPIOE
  *         @arg @ref LL_AHB4_S_GRP1_PERIPH_GPIOF
  *         @arg @ref LL_AHB4_S_GRP1_PERIPH_GPIOG
  *         @arg @ref LL_AHB4_S_GRP1_PERIPH_GPIOH
  *         @arg @ref LL_AHB4_S_GRP1_PERIPH_GPIOI
  * @retval None
  */
__STATIC_INLINE void LL_AHB4_S_GRP1_DisableClock(uint32_t Periphs)
{
  WRITE_REG(RCC->MP_S_AHB4ENCLRR, Periphs);
}

/**
  * @brief  Enable secure AHB4 peripheral clocks in Sleep mode
  * @rmtoll MP_S_AHB4LPENSETR    GPIOA       LL_AHB4_S_GRP1_EnableClockSleep\n
  *         MP_S_AHB4LPENSETR    GPIOB       LL_AHB4_S_GRP1_EnableClockSleep\n
  *         MP_S_AHB4LPENSETR    GPIOC       LL_AHB4_S_GRP1_EnableClockSleep\n
  *         MP_S_AHB4LPENSETR    GPIOD       LL_AHB4_S_GRP1_EnableClockSleep\n
  *         MP_S_AHB4LPENSETR    GPIOE       LL_AHB4_S_GRP1_EnableClockSleep\n
  *         MP_S_AHB4LPENSETR    GPIOF       LL_AHB4_S_GRP1_EnableClockSleep\n
  *         MP_S_AHB4LPENSETR    GPIOG       LL_AHB4_S_GRP1_EnableClockSleep\n
  *         MP_S_AHB4LPENSETR    GPIOH       LL_AHB4_S_GRP1_EnableClockSleep\n
  *         MP_S_AHB4LPENSETR    GPIOI       LL_AHB4_S_GRP1_EnableClockSleep
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB4_S_GRP1_PERIPH_GPIOA
  *         @arg @ref LL_AHB4_S_GRP1_PERIPH_GPIOB
  *         @arg @ref LL_AHB4_S_GRP1_PERIPH_GPIOC
  *         @arg @ref LL_AHB4_S_GRP1_PERIPH_GPIOD
  *         @arg @ref LL_AHB4_S_GRP1_PERIPH_GPIOE
  *         @arg @ref LL_AHB4_S_GRP1_PERIPH_GPIOF
  *         @arg @ref LL_AHB4_S_GRP1_PERIPH_GPIOG
  *         @arg @ref LL_AHB4_S_GRP1_PERIPH_GPIOH
  *         @arg @ref LL_AHB4_S_GRP1_PERIPH_GPIOI
  * @retval None
  */
__STATIC_INLINE void LL_AHB4_S_GRP1_EnableClockSleep(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  WRITE_REG(RCC->MP_S_AHB4LPENSETR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->MP_S_AHB4LPENSETR, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Disable secure AHB4 peripheral clocks in Sleep mode
  * @rmtoll MP_S_AHB4LPENCLRR    GPIOA       LL_AHB4_S_GRP1_DisableClockSleep\n
  *         MP_S_AHB4LPENCLRR    GPIOB       LL_AHB4_S_GRP1_DisableClockSleep\n
  *         MP_S_AHB4LPENCLRR    GPIOC       LL_AHB4_S_GRP1_DisableClockSleep\n
  *         MP_S_AHB4LPENCLRR    GPIOD       LL_AHB4_S_GRP1_DisableClockSleep\n
  *         MP_S_AHB4LPENCLRR    GPIOE       LL_AHB4_S_GRP1_DisableClockSleep\n
  *         MP_S_AHB4LPENCLRR    GPIOF       LL_AHB4_S_GRP1_DisableClockSleep\n
  *         MP_S_AHB4LPENCLRR    GPIOG       LL_AHB4_S_GRP1_DisableClockSleep\n
  *         MP_S_AHB4LPENCLRR    GPIOH       LL_AHB4_S_GRP1_DisableClockSleep\n
  *         MP_S_AHB4LPENCLRR    GPIOI       LL_AHB4_S_GRP1_DisableClockSleep
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB4_S_GRP1_PERIPH_GPIOA
  *         @arg @ref LL_AHB4_S_GRP1_PERIPH_GPIOB
  *         @arg @ref LL_AHB4_S_GRP1_PERIPH_GPIOC
  *         @arg @ref LL_AHB4_S_GRP1_PERIPH_GPIOD
  *         @arg @ref LL_AHB4_S_GRP1_PERIPH_GPIOE
  *         @arg @ref LL_AHB4_S_GRP1_PERIPH_GPIOF
  *         @arg @ref LL_AHB4_S_GRP1_PERIPH_GPIOG
  *         @arg @ref LL_AHB4_S_GRP1_PERIPH_GPIOH
  *         @arg @ref LL_AHB4_S_GRP1_PERIPH_GPIOI
  * @retval None
  */
__STATIC_INLINE void LL_AHB4_S_GRP1_DisableClockSleep(uint32_t Periphs)
{
  WRITE_REG(RCC->MP_S_AHB4LPENCLRR, Periphs);
}
/**
  * @}
  */


/** @defgroup BUS_LL_EF_AHB4_NS AHB4_NS
  * @{
  */

/**
  * @brief  Enable non secure AHB4 peripherals clock.
  * @rmtoll MP_NS_AHB4ENSETR      GPIOA       LL_AHB4_NS_GRP1_EnableClock\n
  *         MP_NS_AHB4ENSETR      GPIOB       LL_AHB4_NS_GRP1_EnableClock\n
  *         MP_NS_AHB4ENSETR      GPIOC       LL_AHB4_NS_GRP1_EnableClock\n
  *         MP_NS_AHB4ENSETR      GPIOD       LL_AHB4_NS_GRP1_EnableClock\n
  *         MP_NS_AHB4ENSETR      GPIOE       LL_AHB4_NS_GRP1_EnableClock\n
  *         MP_NS_AHB4ENSETR      GPIOF       LL_AHB4_NS_GRP1_EnableClock\n
  *         MP_NS_AHB4ENSETR      GPIOG       LL_AHB4_NS_GRP1_EnableClock\n
  *         MP_NS_AHB4ENSETR      GPIOH       LL_AHB4_NS_GRP1_EnableClock\n
  *         MP_NS_AHB4ENSETR      GPIOI       LL_AHB4_NS_GRP1_EnableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB4_NS_GRP1_PERIPH_GPIOA
  *         @arg @ref LL_AHB4_NS_GRP1_PERIPH_GPIOB
  *         @arg @ref LL_AHB4_NS_GRP1_PERIPH_GPIOC
  *         @arg @ref LL_AHB4_NS_GRP1_PERIPH_GPIOD
  *         @arg @ref LL_AHB4_NS_GRP1_PERIPH_GPIOE
  *         @arg @ref LL_AHB4_NS_GRP1_PERIPH_GPIOF
  *         @arg @ref LL_AHB4_NS_GRP1_PERIPH_GPIOG
  *         @arg @ref LL_AHB4_NS_GRP1_PERIPH_GPIOH
  *         @arg @ref LL_AHB4_NS_GRP1_PERIPH_GPIOI
  * @retval None
  */
__STATIC_INLINE void LL_AHB4_NS_GRP1_EnableClock(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  WRITE_REG(RCC->MP_NS_AHB4ENSETR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->MP_NS_AHB4ENSETR, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Check if non secure AHB4 peripheral clock is enabled or not
  * @rmtoll MP_NS_AHB4ENSETR      GPIOA       LL_AHB4_NS_GRP1_IsEnabledClock\n
  *         MP_NS_AHB4ENSETR      GPIOB       LL_AHB4_NS_GRP1_IsEnabledClock\n
  *         MP_NS_AHB4ENSETR      GPIOC       LL_AHB4_NS_GRP1_IsEnabledClock\n
  *         MP_NS_AHB4ENSETR      GPIOD       LL_AHB4_NS_GRP1_IsEnabledClock\n
  *         MP_NS_AHB4ENSETR      GPIOE       LL_AHB4_NS_GRP1_IsEnabledClock\n
  *         MP_NS_AHB4ENSETR      GPIOF       LL_AHB4_NS_GRP1_IsEnabledClock\n
  *         MP_NS_AHB4ENSETR      GPIOG       LL_AHB4_NS_GRP1_IsEnabledClock\n
  *         MP_NS_AHB4ENSETR      GPIOH       LL_AHB4_NS_GRP1_IsEnabledClock\n
  *         MP_NS_AHB4ENSETR      GPIOI       LL_AHB4_NS_GRP1_IsEnabledClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB4_NS_GRP1_PERIPH_GPIOA
  *         @arg @ref LL_AHB4_NS_GRP1_PERIPH_GPIOB
  *         @arg @ref LL_AHB4_NS_GRP1_PERIPH_GPIOC
  *         @arg @ref LL_AHB4_NS_GRP1_PERIPH_GPIOD
  *         @arg @ref LL_AHB4_NS_GRP1_PERIPH_GPIOE
  *         @arg @ref LL_AHB4_NS_GRP1_PERIPH_GPIOF
  *         @arg @ref LL_AHB4_NS_GRP1_PERIPH_GPIOG
  *         @arg @ref LL_AHB4_NS_GRP1_PERIPH_GPIOH
  *         @arg @ref LL_AHB4_NS_GRP1_PERIPH_GPIOI
  * @retval State of Periphs (1 or 0).
  */
__STATIC_INLINE uint32_t LL_AHB4_NS_GRP1_IsEnabledClock(uint32_t Periphs)
{
  return ((READ_BIT(RCC->MP_NS_AHB4ENSETR, Periphs) == Periphs) ? 1U : 0U);
}

/**
  * @brief  Disable non secure AHB4 peripherals clock.
  * @rmtoll MP_NS_AHB4ENCLRR      GPIOA       LL_AHB4_NS_GRP1_DisableClock\n
  *         MP_NS_AHB4ENCLRR      GPIOB       LL_AHB4_NS_GRP1_DisableClock\n
  *         MP_NS_AHB4ENCLRR      GPIOC       LL_AHB4_NS_GRP1_DisableClock\n
  *         MP_NS_AHB4ENCLRR      GPIOD       LL_AHB4_NS_GRP1_DisableClock\n
  *         MP_NS_AHB4ENCLRR      GPIOE       LL_AHB4_NS_GRP1_DisableClock\n
  *         MP_NS_AHB4ENCLRR      GPIOF       LL_AHB4_NS_GRP1_DisableClock\n
  *         MP_NS_AHB4ENCLRR      GPIOG       LL_AHB4_NS_GRP1_DisableClock\n
  *         MP_NS_AHB4ENCLRR      GPIOH       LL_AHB4_NS_GRP1_DisableClock\n
  *         MP_NS_AHB4ENCLRR      GPIOI       LL_AHB4_NS_GRP1_DisableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB4_NS_GRP1_PERIPH_GPIOA
  *         @arg @ref LL_AHB4_NS_GRP1_PERIPH_GPIOB
  *         @arg @ref LL_AHB4_NS_GRP1_PERIPH_GPIOC
  *         @arg @ref LL_AHB4_NS_GRP1_PERIPH_GPIOD
  *         @arg @ref LL_AHB4_NS_GRP1_PERIPH_GPIOE
  *         @arg @ref LL_AHB4_NS_GRP1_PERIPH_GPIOF
  *         @arg @ref LL_AHB4_NS_GRP1_PERIPH_GPIOG
  *         @arg @ref LL_AHB4_NS_GRP1_PERIPH_GPIOH
  *         @arg @ref LL_AHB4_NS_GRP1_PERIPH_GPIOI
  * @retval None
  */
__STATIC_INLINE void LL_AHB4_NS_GRP1_DisableClock(uint32_t Periphs)
{
  WRITE_REG(RCC->MP_NS_AHB4ENCLRR, Periphs);
}

/**
  * @brief  Enable non secure AHB4 peripheral clocks in Sleep mode
  * @rmtoll MP_NS_AHB4LPENSETR    GPIOA       LL_AHB4_NS_GRP1_EnableClockSleep\n
  *         MP_NS_AHB4LPENSETR    GPIOB       LL_AHB4_NS_GRP1_EnableClockSleep\n
  *         MP_NS_AHB4LPENSETR    GPIOC       LL_AHB4_NS_GRP1_EnableClockSleep\n
  *         MP_NS_AHB4LPENSETR    GPIOD       LL_AHB4_NS_GRP1_EnableClockSleep\n
  *         MP_NS_AHB4LPENSETR    GPIOE       LL_AHB4_NS_GRP1_EnableClockSleep\n
  *         MP_NS_AHB4LPENSETR    GPIOF       LL_AHB4_NS_GRP1_EnableClockSleep\n
  *         MP_NS_AHB4LPENSETR    GPIOG       LL_AHB4_NS_GRP1_EnableClockSleep\n
  *         MP_NS_AHB4LPENSETR    GPIOH       LL_AHB4_NS_GRP1_EnableClockSleep\n
  *         MP_NS_AHB4LPENSETR    GPIOI       LL_AHB4_NS_GRP1_EnableClockSleep
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB4_NS_GRP1_PERIPH_GPIOA
  *         @arg @ref LL_AHB4_NS_GRP1_PERIPH_GPIOB
  *         @arg @ref LL_AHB4_NS_GRP1_PERIPH_GPIOC
  *         @arg @ref LL_AHB4_NS_GRP1_PERIPH_GPIOD
  *         @arg @ref LL_AHB4_NS_GRP1_PERIPH_GPIOE
  *         @arg @ref LL_AHB4_NS_GRP1_PERIPH_GPIOF
  *         @arg @ref LL_AHB4_NS_GRP1_PERIPH_GPIOG
  *         @arg @ref LL_AHB4_NS_GRP1_PERIPH_GPIOH
  *         @arg @ref LL_AHB4_NS_GRP1_PERIPH_GPIOI
  * @retval None
  */
__STATIC_INLINE void LL_AHB4_NS_GRP1_EnableClockSleep(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  WRITE_REG(RCC->MP_NS_AHB4LPENSETR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->MP_NS_AHB4LPENSETR, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Disable non secure AHB4 peripheral clocks in Sleep mode
  * @rmtoll MP_NS_AHB4LPENCLRR    GPIOA       LL_AHB4_NS_GRP1_DisableClockSleep\n
  *         MP_NS_AHB4LPENCLRR    GPIOB       LL_AHB4_NS_GRP1_DisableClockSleep\n
  *         MP_NS_AHB4LPENCLRR    GPIOC       LL_AHB4_NS_GRP1_DisableClockSleep\n
  *         MP_NS_AHB4LPENCLRR    GPIOD       LL_AHB4_NS_GRP1_DisableClockSleep\n
  *         MP_NS_AHB4LPENCLRR    GPIOE       LL_AHB4_NS_GRP1_DisableClockSleep\n
  *         MP_NS_AHB4LPENCLRR    GPIOF       LL_AHB4_NS_GRP1_DisableClockSleep\n
  *         MP_NS_AHB4LPENCLRR    GPIOG       LL_AHB4_NS_GRP1_DisableClockSleep\n
  *         MP_NS_AHB4LPENCLRR    GPIOH       LL_AHB4_NS_GRP1_DisableClockSleep\n
  *         MP_NS_AHB4LPENCLRR    GPIOI       LL_AHB4_NS_GRP1_DisableClockSleep
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB4_NS_GRP1_PERIPH_GPIOA
  *         @arg @ref LL_AHB4_NS_GRP1_PERIPH_GPIOB
  *         @arg @ref LL_AHB4_NS_GRP1_PERIPH_GPIOC
  *         @arg @ref LL_AHB4_NS_GRP1_PERIPH_GPIOD
  *         @arg @ref LL_AHB4_NS_GRP1_PERIPH_GPIOE
  *         @arg @ref LL_AHB4_NS_GRP1_PERIPH_GPIOF
  *         @arg @ref LL_AHB4_NS_GRP1_PERIPH_GPIOG
  *         @arg @ref LL_AHB4_NS_GRP1_PERIPH_GPIOH
  *         @arg @ref LL_AHB4_NS_GRP1_PERIPH_GPIOI
  * @retval None
  */
__STATIC_INLINE void LL_AHB4_NS_GRP1_DisableClockSleep(uint32_t Periphs)
{
  WRITE_REG(RCC->MP_NS_AHB4LPENCLRR, Periphs);
}
/**
  * @}
  */

/** @defgroup BUS_LL_EF_AHB5 AHB5
  * @{
  */

/**
  * @brief  Enable AHB5 peripherals clock.
  * @rmtoll MP_AHB5ENSETR      PKA          LL_AHB5_GRP1_EnableClock\n
  *         MP_AHB5ENSETR      SAES         LL_AHB5_GRP1_EnableClock\n
  *         MP_AHB5ENSETR      CRYP1        LL_AHB5_GRP1_EnableClock\n
  *         MP_AHB5ENSETR      HASH1        LL_AHB5_GRP1_EnableClock\n
  *         MP_AHB5ENSETR      RNG1         LL_AHB5_GRP1_EnableClock\n
  *         MP_AHB5ENSETR      BKPSRAM      LL_AHB5_GRP1_EnableClock\n
  *         MP_AHB5ENSETR      AXIMC        LL_AHB5_GRP1_EnableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB5_GRP1_PERIPH_PKA
  *         @arg @ref LL_AHB5_GRP1_PERIPH_SAES
  *         @arg @ref LL_AHB5_GRP1_PERIPH_CRYP1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_HASH1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_RNG1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_BKPSRAM
  *         @arg @ref LL_AHB5_GRP1_PERIPH_AXIMC
  * @retval None
  */
__STATIC_INLINE void LL_AHB5_GRP1_EnableClock(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  WRITE_REG(RCC->MP_AHB5ENSETR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->MP_AHB5ENSETR, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Check if AHB5 peripheral clock is enabled or not
  * @rmtoll MP_AHB5ENSETR      PKA          LL_AHB5_GRP1_IsEnabledClock\n
  *         MP_AHB5ENSETR      SAES         LL_AHB5_GRP1_IsEnabledClock\n
  *         MP_AHB5ENSETR      CRYP1        LL_AHB5_GRP1_IsEnabledClock\n
  *         MP_AHB5ENSETR      HASH1        LL_AHB5_GRP1_IsEnabledClock\n
  *         MP_AHB5ENSETR      RNG1         LL_AHB5_GRP1_IsEnabledClock\n
  *         MP_AHB5ENSETR      BKPSRAM      LL_AHB5_GRP1_IsEnabledClock\n
  *         MP_AHB5ENSETR      AXIMC        LL_AHB5_GRP1_IsEnabledClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB5_GRP1_PERIPH_PKA
  *         @arg @ref LL_AHB5_GRP1_PERIPH_SAES
  *         @arg @ref LL_AHB5_GRP1_PERIPH_CRYP1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_HASH1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_RNG1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_BKPSRAM
  *         @arg @ref LL_AHB5_GRP1_PERIPH_AXIMC
  * @retval State of Periphs (1 or 0).
  */
__STATIC_INLINE uint32_t LL_AHB5_GRP1_IsEnabledClock(uint32_t Periphs)
{
  return ((READ_BIT(RCC->MP_AHB5ENSETR, Periphs) == Periphs) ? 1U : 0U);
}

/**
  * @brief  Disable AHB5 peripherals clock.
  * @rmtoll MP_AHB5ENCLRR      PKA          LL_AHB5_GRP1_DisableClock\n
  *         MP_AHB5ENCLRR      SAES         LL_AHB5_GRP1_DisableClock\n
  *         MP_AHB5ENCLRR      CRYP1        LL_AHB5_GRP1_DisableClock\n
  *         MP_AHB5ENCLRR      HASH1        LL_AHB5_GRP1_DisableClock\n
  *         MP_AHB5ENCLRR      RNG1         LL_AHB5_GRP1_DisableClock\n
  *         MP_AHB5ENCLRR      BKPSRAM      LL_AHB5_GRP1_DisableClock\n
  *         MP_AHB5ENCLRR      AXIMC        LL_AHB5_GRP1_DisableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB5_GRP1_PERIPH_PKA
  *         @arg @ref LL_AHB5_GRP1_PERIPH_SAES
  *         @arg @ref LL_AHB5_GRP1_PERIPH_CRYP1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_HASH1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_RNG1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_BKPSRAM
  *         @arg @ref LL_AHB5_GRP1_PERIPH_AXIMC
  * @retval None
  */
__STATIC_INLINE void LL_AHB5_GRP1_DisableClock(uint32_t Periphs)
{
  WRITE_REG(RCC->MP_AHB5ENCLRR, Periphs);
}

/**
  * @brief  Force AHB5 peripherals reset.
  * @rmtoll AHB5RSTSETR      PKA          LL_AHB5_GRP1_ForceReset\n
  *         AHB5RSTSETR      SAES         LL_AHB5_GRP1_ForceReset\n
  *         AHB5RSTSETR      CRYP1        LL_AHB5_GRP1_ForceReset\n
  *         AHB5RSTSETR      HASH1        LL_AHB5_GRP1_ForceReset\n
  *         AHB5RSTSETR      RNG1         LL_AHB5_GRP1_ForceReset\n
  *         AHB5RSTSETR      AXIMC        LL_AHB5_GRP1_ForceReset
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB5_GRP1_PERIPH_ALL
  *         @arg @ref LL_AHB5_GRP1_PERIPH_PKA
  *         @arg @ref LL_AHB5_GRP1_PERIPH_SAES
  *         @arg @ref LL_AHB5_GRP1_PERIPH_CRYP1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_HASH1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_RNG1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_AXIMC
  * @retval None
  */
__STATIC_INLINE void LL_AHB5_GRP1_ForceReset(uint32_t Periphs)
{
  WRITE_REG(RCC->AHB5RSTSETR, Periphs);
}

/**
  * @brief  Release AHB5 peripherals reset.
  * @rmtoll AHB5RSTCLRR      PKA          LL_AHB5_GRP1_ReleaseReset\n
  *         AHB5RSTCLRR      SAES         LL_AHB5_GRP1_ReleaseReset\n
  *         AHB5RSTCLRR      CRYP1        LL_AHB5_GRP1_ReleaseReset\n
  *         AHB5RSTCLRR      HASH1        LL_AHB5_GRP1_ReleaseReset\n
  *         AHB5RSTCLRR      RNG1         LL_AHB5_GRP1_ReleaseReset\n
  *         AHB5RSTCLRR      AXIMC        LL_AHB5_GRP1_ReleaseReset
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB5_GRP1_PERIPH_ALL
  *         @arg @ref LL_AHB5_GRP1_PERIPH_PKA
  *         @arg @ref LL_AHB5_GRP1_PERIPH_SAES
  *         @arg @ref LL_AHB5_GRP1_PERIPH_CRYP1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_HASH1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_RNG1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_AXIMC
  * @retval None
  */
__STATIC_INLINE void LL_AHB5_GRP1_ReleaseReset(uint32_t Periphs)
{
  WRITE_REG(RCC->AHB5RSTCLRR, Periphs);
}

