zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/include/stm32mp13xx_ll_bus.h
/**
  * @brief  Enable AHB5 peripheral clocks in Sleep mode
  * @rmtoll MP_AHB5LPENSETR      PKA          LL_AHB5_GRP1_EnableClockSleep\n
  *         MP_AHB5LPENSETR      SAES         LL_AHB5_GRP1_EnableClockSleep\n
  *         MP_AHB5LPENSETR      CRYP1        LL_AHB5_GRP1_EnableClockSleep\n
  *         MP_AHB5LPENSETR      HASH1        LL_AHB5_GRP1_EnableClockSleep\n
  *         MP_AHB5LPENSETR      RNG1         LL_AHB5_GRP1_EnableClockSleep\n
  *         MP_AHB5LPENSETR      BKPSRAM      LL_AHB5_GRP1_EnableClockSleep
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB5_GRP1_PERIPH_PKA
  *         @arg @ref LL_AHB5_GRP1_PERIPH_SAES
  *         @arg @ref LL_AHB5_GRP1_PERIPH_CRYP1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_HASH1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_RNG1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_BKPSRAM
  * @retval None
  */
__STATIC_INLINE void LL_AHB5_GRP1_EnableClockSleep(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  WRITE_REG(RCC->MP_AHB5LPENSETR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->MP_AHB5LPENSETR, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Disable AHB5 peripheral clocks in Sleep mode
  * @rmtoll MP_AHB5LPENCLRR      PKA          LL_AHB5_GRP1_DisableClockSleep\n
  *         MP_AHB5LPENCLRR      SAES         LL_AHB5_GRP1_DisableClockSleep\n
  *         MP_AHB5LPENCLRR      CRYP1        LL_AHB5_GRP1_DisableClockSleep\n
  *         MP_AHB5LPENCLRR      HASH1        LL_AHB5_GRP1_DisableClockSleep\n
  *         MP_AHB5LPENCLRR      RNG1         LL_AHB5_GRP1_DisableClockSleep\n
  *         MP_AHB5LPENCLRR      BKPSRAM      LL_AHB5_GRP1_DisableClockSleep
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB5_GRP1_PERIPH_PKA
  *         @arg @ref LL_AHB5_GRP1_PERIPH_SAES
  *         @arg @ref LL_AHB5_GRP1_PERIPH_CRYP1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_HASH1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_RNG1
  *         @arg @ref LL_AHB5_GRP1_PERIPH_BKPSRAM
  * @retval None
  */
__STATIC_INLINE void LL_AHB5_GRP1_DisableClockSleep(uint32_t Periphs)
{
  WRITE_REG(RCC->MP_AHB5LPENCLRR, Periphs);
}
/**
  * @}
  */

/** @defgroup BUS_LL_EF_AHB6 AHB6
  * @{
  */

/**
  * @brief  Enable AHB6 peripherals clock.
  * @rmtoll MP_AHB6ENSETR      MCE         LL_AHB6_GRP1_EnableClock\n
  *         MP_AHB6ENSETR      ETH1CK      LL_AHB6_GRP1_EnableClock\n
  *         MP_AHB6ENSETR      ETH1TX      LL_AHB6_GRP1_EnableClock\n
  *         MP_AHB6ENSETR      ETH1RX      LL_AHB6_GRP1_EnableClock\n
  *         MP_AHB6ENSETR      ETH1MAC     LL_AHB6_GRP1_EnableClock\n
  *         MP_AHB6ENSETR      FMC         LL_AHB6_GRP1_EnableClock\n
  *         MP_AHB6ENSETR      QSPI        LL_AHB6_GRP1_EnableClock\n
  *         MP_AHB6ENSETR      SDMMC1      LL_AHB6_GRP1_EnableClock\n
  *         MP_AHB6ENSETR      SDMMC2      LL_AHB6_GRP1_EnableClock\n
  *         MP_AHB6ENSETR      CRC1        LL_AHB6_GRP1_EnableClock\n
  *         MP_AHB6ENSETR      USBH        LL_AHB6_GRP1_EnableClock\n
  *         MP_AHB6ENSETR      ETH2CK      LL_AHB6_GRP1_EnableClock\n
  *         MP_AHB6ENSETR      ETH2TX      LL_AHB6_GRP1_EnableClock\n
  *         MP_AHB6ENSETR      ETH2RX      LL_AHB6_GRP1_EnableClock\n
  *         MP_AHB6ENSETR      ETH2MAC     LL_AHB6_GRP1_EnableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB6_GRP1_PERIPH_MCE
  *         @arg @ref LL_AHB6_GRP1_PERIPH_ETH1CK
  *         @arg @ref LL_AHB6_GRP1_PERIPH_ETH1TX
  *         @arg @ref LL_AHB6_GRP1_PERIPH_ETH1RX
  *         @arg @ref LL_AHB6_GRP1_PERIPH_ETH1MAC
  *         @arg @ref LL_AHB6_GRP1_PERIPH_FMC
  *         @arg @ref LL_AHB6_GRP1_PERIPH_QSPI
  *         @arg @ref LL_AHB6_GRP1_PERIPH_SDMMC1
  *         @arg @ref LL_AHB6_GRP1_PERIPH_SDMMC2
  *         @arg @ref LL_AHB6_GRP1_PERIPH_CRC1
  *         @arg @ref LL_AHB6_GRP1_PERIPH_USBH
  *         @arg @ref LL_AHB6_GRP1_PERIPH_ETH2CK
  *         @arg @ref LL_AHB6_GRP1_PERIPH_ETH2TX
  *         @arg @ref LL_AHB6_GRP1_PERIPH_ETH2RX
  *         @arg @ref LL_AHB6_GRP1_PERIPH_ETH2MAC
  * @retval None
  */
__STATIC_INLINE void LL_AHB6_GRP1_EnableClock(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  WRITE_REG(RCC->MP_AHB6ENSETR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->MP_AHB6ENSETR, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Check if AHB6 peripheral clock is enabled or not
  * @rmtoll MP_AHB6ENSETR      MCE         LL_AHB6_GRP1_EnableClock\n
  *         MP_AHB6ENSETR      ETH1CK      LL_AHB6_GRP1_EnableClock\n
  *         MP_AHB6ENSETR      ETH1TX      LL_AHB6_GRP1_EnableClock\n
  *         MP_AHB6ENSETR      ETH1RX      LL_AHB6_GRP1_EnableClock\n
  *         MP_AHB6ENSETR      ETH1MAC     LL_AHB6_GRP1_EnableClock\n
  *         MP_AHB6ENSETR      FMC         LL_AHB6_GRP1_EnableClock\n
  *         MP_AHB6ENSETR      QSPI        LL_AHB6_GRP1_EnableClock\n
  *         MP_AHB6ENSETR      SDMMC1      LL_AHB6_GRP1_EnableClock\n
  *         MP_AHB6ENSETR      SDMMC2      LL_AHB6_GRP1_EnableClock\n
  *         MP_AHB6ENSETR      CRC1        LL_AHB6_GRP1_EnableClock\n
  *         MP_AHB6ENSETR      USBH        LL_AHB6_GRP1_EnableClock\n
  *         MP_AHB6ENSETR      ETH2CK      LL_AHB6_GRP1_EnableClock\n
  *         MP_AHB6ENSETR      ETH2TX      LL_AHB6_GRP1_EnableClock\n
  *         MP_AHB6ENSETR      ETH2RX      LL_AHB6_GRP1_EnableClock\n
  *         MP_AHB6ENSETR      ETH2MAC     LL_AHB6_GRP1_EnableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB6_GRP1_PERIPH_MCE
  *         @arg @ref LL_AHB6_GRP1_PERIPH_ETH1CK
  *         @arg @ref LL_AHB6_GRP1_PERIPH_ETH1TX
  *         @arg @ref LL_AHB6_GRP1_PERIPH_ETH1RX
  *         @arg @ref LL_AHB6_GRP1_PERIPH_ETH1MAC
  *         @arg @ref LL_AHB6_GRP1_PERIPH_FMC
  *         @arg @ref LL_AHB6_GRP1_PERIPH_QSPI
  *         @arg @ref LL_AHB6_GRP1_PERIPH_SDMMC1
  *         @arg @ref LL_AHB6_GRP1_PERIPH_SDMMC2
  *         @arg @ref LL_AHB6_GRP1_PERIPH_CRC1
  *         @arg @ref LL_AHB6_GRP1_PERIPH_USBH
  *         @arg @ref LL_AHB6_GRP1_PERIPH_ETH2CK
  *         @arg @ref LL_AHB6_GRP1_PERIPH_ETH2TX
  *         @arg @ref LL_AHB6_GRP1_PERIPH_ETH2RX
  *         @arg @ref LL_AHB6_GRP1_PERIPH_ETH2MAC
  * @retval State of Periphs (1 or 0).
  */
__STATIC_INLINE uint32_t LL_AHB6_GRP1_IsEnabledClock(uint32_t Periphs)
{
  return ((READ_BIT(RCC->MP_AHB6ENSETR, Periphs) == Periphs) ? 1U : 0U);
}

/**
  * @brief  Disable AHB6 peripherals clock.
  * @rmtoll MP_AHB6ENCLRR      MCE         LL_AHB6_GRP1_DisableClock\n
  *         MP_AHB6ENCLRR      ETH1CK      LL_AHB6_GRP1_DisableClock\n
  *         MP_AHB6ENCLRR      ETH1TX      LL_AHB6_GRP1_DisableClock\n
  *         MP_AHB6ENCLRR      ETH1RX      LL_AHB6_GRP1_DisableClock\n
  *         MP_AHB6ENCLRR      ETH1MAC     LL_AHB6_GRP1_DisableClock\n
  *         MP_AHB6ENCLRR      FMC         LL_AHB6_GRP1_DisableClock\n
  *         MP_AHB6ENCLRR      QSPI        LL_AHB6_GRP1_DisableClock\n
  *         MP_AHB6ENCLRR      SDMMC1      LL_AHB6_GRP1_DisableClock\n
  *         MP_AHB6ENCLRR      SDMMC2      LL_AHB6_GRP1_DisableClock\n
  *         MP_AHB6ENCLRR      CRC1        LL_AHB6_GRP1_DisableClock\n
  *         MP_AHB6ENCLRR      USBH        LL_AHB6_GRP1_DisableClock\n
  *         MP_AHB6ENCLRR      ETH2CK      LL_AHB6_GRP1_DisableClock\n
  *         MP_AHB6ENCLRR      ETH2TX      LL_AHB6_GRP1_DisableClock\n
  *         MP_AHB6ENCLRR      ETH2RX      LL_AHB6_GRP1_DisableClock\n
  *         MP_AHB6ENCLRR      ETH2MAC     LL_AHB6_GRP1_DisableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB6_GRP1_PERIPH_MCE
  *         @arg @ref LL_AHB6_GRP1_PERIPH_ETH1CK
  *         @arg @ref LL_AHB6_GRP1_PERIPH_ETH1TX
  *         @arg @ref LL_AHB6_GRP1_PERIPH_ETH1RX
  *         @arg @ref LL_AHB6_GRP1_PERIPH_ETH1MAC
  *         @arg @ref LL_AHB6_GRP1_PERIPH_FMC
  *         @arg @ref LL_AHB6_GRP1_PERIPH_QSPI
  *         @arg @ref LL_AHB6_GRP1_PERIPH_SDMMC1
  *         @arg @ref LL_AHB6_GRP1_PERIPH_SDMMC2
  *         @arg @ref LL_AHB6_GRP1_PERIPH_CRC1
  *         @arg @ref LL_AHB6_GRP1_PERIPH_USBH
  *         @arg @ref LL_AHB6_GRP1_PERIPH_ETH2CK
  *         @arg @ref LL_AHB6_GRP1_PERIPH_ETH2TX
  *         @arg @ref LL_AHB6_GRP1_PERIPH_ETH2RX
  *         @arg @ref LL_AHB6_GRP1_PERIPH_ETH2MAC
  * @retval None
  */
__STATIC_INLINE void LL_AHB6_GRP1_DisableClock(uint32_t Periphs)
{
  WRITE_REG(RCC->MP_AHB6ENCLRR, Periphs);
}

/**
  * @brief  Force AHB6 peripherals reset.
  * @rmtoll AHB6RSTSETR      MDMA        LL_AHB6_GRP1_ForceReset\n
  *         AHB6RSTSETR      MCE         LL_AHB6_GRP1_ForceReset\n
  *         AHB6RSTSETR      ETH1MAC     LL_AHB6_GRP1_ForceReset\n
  *         AHB6RSTSETR      FMC         LL_AHB6_GRP1_ForceReset\n
  *         AHB6RSTSETR      QSPI        LL_AHB6_GRP1_ForceReset\n
  *         AHB6RSTSETR      SDMMC1      LL_AHB6_GRP1_ForceReset\n
  *         AHB6RSTSETR      SDMMC2      LL_AHB6_GRP1_ForceReset\n
  *         AHB6RSTSETR      CRC1        LL_AHB6_GRP1_ForceReset\n
  *         AHB6RSTSETR      USBH        LL_AHB6_GRP1_ForceReset\n
  *         AHB6RSTSETR      ETH2MAC     LL_AHB6_GRP1_ForceReset
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB6_GRP1_PERIPH_ALL
  *         @arg @ref LL_AHB6_S_GRP1_PERIPH_MDMA
  *         @arg @ref LL_AHB6_GRP1_PERIPH_MCE
  *         @arg @ref LL_AHB6_GRP1_PERIPH_ETH1MAC
  *         @arg @ref LL_AHB6_GRP1_PERIPH_FMC
  *         @arg @ref LL_AHB6_GRP1_PERIPH_QSPI
  *         @arg @ref LL_AHB6_GRP1_PERIPH_SDMMC1
  *         @arg @ref LL_AHB6_GRP1_PERIPH_SDMMC2
  *         @arg @ref LL_AHB6_GRP1_PERIPH_CRC1
  *         @arg @ref LL_AHB6_GRP1_PERIPH_USBH
  *         @arg @ref LL_AHB6_GRP1_PERIPH_ETH2MAC
  * @retval None
  */
__STATIC_INLINE void LL_AHB6_GRP1_ForceReset(uint32_t Periphs)
{
  WRITE_REG(RCC->AHB6RSTSETR, Periphs);
}

/**
  * @brief  Release AHB6 peripherals reset.
  * @rmtoll AHB6RSTCLRR      MDMA        LL_AHB6_GRP1_ReleaseReset\n
  *         AHB6RSTCLRR      MCE         LL_AHB6_GRP1_ReleaseReset\n
  *         AHB6RSTCLRR      ETH1MAC     LL_AHB6_GRP1_ReleaseReset\n
  *         AHB6RSTCLRR      FMC         LL_AHB6_GRP1_ReleaseReset\n
  *         AHB6RSTCLRR      QSPI        LL_AHB6_GRP1_ReleaseReset\n
  *         AHB6RSTCLRR      SDMMC1      LL_AHB6_GRP1_ReleaseReset\n
  *         AHB6RSTCLRR      SDMMC2      LL_AHB6_GRP1_ReleaseReset\n
  *         AHB6RSTCLRR      CRC1        LL_AHB6_GRP1_ReleaseReset\n
  *         AHB6RSTCLRR      USBH        LL_AHB6_GRP1_ReleaseReset\n
  *         AHB6RSTCLRR      ETH2MAC     LL_AHB6_GRP1_ReleaseReset
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB6_GRP1_PERIPH_ALL
  *         @arg @ref LL_AHB6_S_GRP1_PERIPH_MDMA
  *         @arg @ref LL_AHB6_GRP1_PERIPH_MCE
  *         @arg @ref LL_AHB6_GRP1_PERIPH_ETH1MAC
  *         @arg @ref LL_AHB6_GRP1_PERIPH_FMC
  *         @arg @ref LL_AHB6_GRP1_PERIPH_QSPI
  *         @arg @ref LL_AHB6_GRP1_PERIPH_SDMMC1
  *         @arg @ref LL_AHB6_GRP1_PERIPH_SDMMC2
  *         @arg @ref LL_AHB6_GRP1_PERIPH_CRC1
  *         @arg @ref LL_AHB6_GRP1_PERIPH_USBH
  *         @arg @ref LL_AHB6_GRP1_PERIPH_ETH2MAC
  * @retval None
  */
__STATIC_INLINE void LL_AHB6_GRP1_ReleaseReset(uint32_t Periphs)
{
  WRITE_REG(RCC->AHB6RSTCLRR, Periphs);
}

/**
  * @brief  Enable AHB6 peripheral clocks in Sleep mode
  * @rmtoll MP_AHB6LPENSETR      MCE         LL_AHB6_GRP1_EnableClockSleep\n
  *         MP_AHB6LPENSETR      ETH1CK      LL_AHB6_GRP1_EnableClockSleep\n
  *         MP_AHB6LPENSETR      ETH1TX      LL_AHB6_GRP1_EnableClockSleep\n
  *         MP_AHB6LPENSETR      ETH1RX      LL_AHB6_GRP1_EnableClockSleep\n
  *         MP_AHB6LPENSETR      ETH1MAC     LL_AHB6_GRP1_EnableClockSleep\n
  *         MP_AHB6LPENSETR      FMC         LL_AHB6_GRP1_EnableClockSleep\n
  *         MP_AHB6LPENSETR      QSPI        LL_AHB6_GRP1_EnableClockSleep\n
  *         MP_AHB6LPENSETR      SDMMC1      LL_AHB6_GRP1_EnableClockSleep\n
  *         MP_AHB6LPENSETR      SDMMC2      LL_AHB6_GRP1_EnableClockSleep\n
  *         MP_AHB6LPENSETR      CRC1        LL_AHB6_GRP1_EnableClockSleep\n
  *         MP_AHB6LPENSETR      USBH        LL_AHB6_GRP1_EnableClockSleep\n
  *         MP_AHB6LPENSETR      ETH2CK      LL_AHB6_GRP1_EnableClockSleep\n
  *         MP_AHB6LPENSETR      ETH2TX      LL_AHB6_GRP1_EnableClockSleep\n
  *         MP_AHB6LPENSETR      ETH2RX      LL_AHB6_GRP1_EnableClockSleep\n
  *         MP_AHB6LPENSETR      ETH2MAC     LL_AHB6_GRP1_EnableClockSleep
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB6_GRP1_PERIPH_MCE
  *         @arg @ref LL_AHB6_GRP1_PERIPH_ETH1CK
  *         @arg @ref LL_AHB6_GRP1_PERIPH_ETH1TX
  *         @arg @ref LL_AHB6_GRP1_PERIPH_ETH1RX
  *         @arg @ref LL_AHB6_GRP1_PERIPH_ETH1MAC
  *         @arg @ref LL_AHB6_GRP1_PERIPH_FMC
  *         @arg @ref LL_AHB6_GRP1_PERIPH_QSPI
  *         @arg @ref LL_AHB6_GRP1_PERIPH_SDMMC1
  *         @arg @ref LL_AHB6_GRP1_PERIPH_SDMMC2
  *         @arg @ref LL_AHB6_GRP1_PERIPH_CRC1
  *         @arg @ref LL_AHB6_GRP1_PERIPH_USBH
  *         @arg @ref LL_AHB6_GRP1_PERIPH_ETH2CK
  *         @arg @ref LL_AHB6_GRP1_PERIPH_ETH2TX
  *         @arg @ref LL_AHB6_GRP1_PERIPH_ETH2RX
  *         @arg @ref LL_AHB6_GRP1_PERIPH_ETH2MAC
  * @retval None
  */
__STATIC_INLINE void LL_AHB6_GRP1_EnableClockSleep(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  WRITE_REG(RCC->MP_AHB6LPENSETR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->MP_AHB6LPENSETR, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Disable AHB6 peripheral clocks in Sleep mode
  * @rmtoll MP_AHB6LPENCLRR      MCE         LL_AHB6_GRP1_DisableClockSleep\n
  *         MP_AHB6LPENCLRR      ETH1CK      LL_AHB6_GRP1_DisableClockSleep\n
  *         MP_AHB6LPENCLRR      ETH1TX      LL_AHB6_GRP1_DisableClockSleep\n
  *         MP_AHB6LPENCLRR      ETH1RX      LL_AHB6_GRP1_DisableClockSleep\n
  *         MP_AHB6LPENCLRR      ETH1MAC     LL_AHB6_GRP1_DisableClockSleep\n
  *         MP_AHB6LPENCLRR      FMC         LL_AHB6_GRP1_DisableClockSleep\n
  *         MP_AHB6LPENCLRR      QSPI        LL_AHB6_GRP1_DisableClockSleep\n
  *         MP_AHB6LPENCLRR      SDMMC1      LL_AHB6_GRP1_DisableClockSleep\n
  *         MP_AHB6LPENCLRR      SDMMC2      LL_AHB6_GRP1_DisableClockSleep\n
  *         MP_AHB6LPENCLRR      CRC1        LL_AHB6_GRP1_DisableClockSleep\n
  *         MP_AHB6LPENCLRR      USBH        LL_AHB6_GRP1_DisableClockSleep\n
  *         MP_AHB6LPENCLRR      ETH2CK      LL_AHB6_GRP1_DisableClockSleep\n
  *         MP_AHB6LPENCLRR      ETH2TX      LL_AHB6_GRP1_DisableClockSleep\n
  *         MP_AHB6LPENCLRR      ETH2RX      LL_AHB6_GRP1_DisableClockSleep\n
  *         MP_AHB6LPENCLRR      ETH2MAC     LL_AHB6_GRP1_DisableClockSleep
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB6_GRP1_PERIPH_MCE
  *         @arg @ref LL_AHB6_GRP1_PERIPH_ETH1CK
  *         @arg @ref LL_AHB6_GRP1_PERIPH_ETH1TX
  *         @arg @ref LL_AHB6_GRP1_PERIPH_ETH1RX
  *         @arg @ref LL_AHB6_GRP1_PERIPH_ETH1MAC
  *         @arg @ref LL_AHB6_GRP1_PERIPH_FMC
  *         @arg @ref LL_AHB6_GRP1_PERIPH_QSPI
  *         @arg @ref LL_AHB6_GRP1_PERIPH_SDMMC1
  *         @arg @ref LL_AHB6_GRP1_PERIPH_SDMMC2
  *         @arg @ref LL_AHB6_GRP1_PERIPH_CRC1
  *         @arg @ref LL_AHB6_GRP1_PERIPH_USBH
  *         @arg @ref LL_AHB6_GRP1_PERIPH_ETH2CK
  *         @arg @ref LL_AHB6_GRP1_PERIPH_ETH2TX
  *         @arg @ref LL_AHB6_GRP1_PERIPH_ETH2RX
  *         @arg @ref LL_AHB6_GRP1_PERIPH_ETH2MAC
  * @retval None
  */
__STATIC_INLINE void LL_AHB6_GRP1_DisableClockSleep(uint32_t Periphs)
{
  WRITE_REG(RCC->MP_AHB6LPENCLRR, Periphs);
}

/**
  * @brief  Enable AHB6 peripheral clocks in Stop mode
  * @rmtoll MP_AHB6LPENSETR    ETH1STP       LL_AHB6_GRP1_EnableClockStop\n
  *         MP_AHB6LPENSETR    ETH2STP       LL_AHB6_GRP1_EnableClockStop
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB6_GRP1_PERIPH_ETH1STP
  *         @arg @ref LL_AHB6_GRP1_PERIPH_ETH2STP
  * @retval None
  */
__STATIC_INLINE void LL_AHB6_GRP1_EnableClockStop(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  WRITE_REG(RCC->MP_AHB6LPENSETR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->MP_AHB6LPENSETR, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Disable AHB6 peripheral clocks in Sleep mode
  * @rmtoll MP_AHB6LPENCLRR    ETH1STP       LL_AHB6_GRP1_DisableClockStop\n
  *         MP_AHB6LPENCLRR    ETH2STP       LL_AHB6_GRP1_DisableClockStop
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB6_GRP1_PERIPH_ETH1STP
  *         @arg @ref LL_AHB6_GRP1_PERIPH_ETH2STP
  * @retval None
  */
__STATIC_INLINE void LL_AHB6_GRP1_DisableClockStop(uint32_t Periphs)
{
  WRITE_REG(RCC->MP_AHB6LPENCLRR, Periphs);
}

/**
  * @}
  */

/** @defgroup BUS_LL_EF_AHB6_S AHB6_S
  * @{
  */

/**
  * @brief  Enable secure AHB6 peripherals clock.
  * @rmtoll MP_S_AHB6ENSETR      MDMA         LL_AHB6_S_GRP1_EnableClock\n
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB6_S_GRP1_PERIPH_MDMA
  * @retval None
  */
__STATIC_INLINE void LL_AHB6_S_GRP1_EnableClock(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  WRITE_REG(RCC->MP_S_AHB6ENSETR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->MP_S_AHB6ENSETR, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Check if secure AHB6 peripheral clock is enabled or not
  * @rmtoll MP_S_AHB6ENSETR      MDMA         LL_AHB6_S_GRP1_EnableClock\n
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB6_S_GRP1_PERIPH_MDMA
  * @retval State of Periphs (1 or 0).
  */
__STATIC_INLINE uint32_t LL_AHB6_S_GRP1_IsEnabledClock(uint32_t Periphs)
{
  return ((READ_BIT(RCC->MP_S_AHB6ENSETR, Periphs) == Periphs) ? 1U : 0U);
}

/**
  * @brief  Disable secure AHB6 peripherals clock.
  * @rmtoll MP_S_AHB6ENCLRR      MDMA         LL_AHB6_S_GRP1_DisableClock\n
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB6_S_GRP1_PERIPH_MDMA
  * @retval None
  */
__STATIC_INLINE void LL_AHB6_S_GRP1_DisableClock(uint32_t Periphs)
{
  WRITE_REG(RCC->MP_S_AHB6ENCLRR, Periphs);
}

/**
  * @brief  Enable secure AHB6 peripheral clocks in Sleep mode
  * @rmtoll MP_S_AHB6LPENSETR      MDMA         LL_AHB6_S_GRP1_EnableClockSleep\n
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB6_S_GRP1_PERIPH_MDMA
  * @retval None
  */
__STATIC_INLINE void LL_AHB6_S_GRP1_EnableClockSleep(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  WRITE_REG(RCC->MP_S_AHB6LPENSETR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->MP_S_AHB6LPENSETR, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Disable secure AHB6 peripheral clocks in Sleep mode
  * @rmtoll MP_S_AHB6LPENCLRR      MDMA         LL_AHB6_S_GRP1_DisableClockSleep\n
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB6_S_GRP1_PERIPH_MDMA
  * @retval None
  */
__STATIC_INLINE void LL_AHB6_S_GRP1_DisableClockSleep(uint32_t Periphs)
{
  WRITE_REG(RCC->MP_S_AHB6LPENCLRR, Periphs);
}
/**
  * @}
  */

/** @defgroup BUS_LL_EF_AHB6_NS AHB6_NS
  * @{
  */

/**
  * @brief  Enable non secure AHB6 peripherals clock.
  * @rmtoll MP_NS_AHB6ENSETR      MDMA         LL_AHB6_NS_GRP1_EnableClock\n
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB6_NS_GRP1_PERIPH_MDMA
  * @retval None
  */
__STATIC_INLINE void LL_AHB6_NS_GRP1_EnableClock(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  WRITE_REG(RCC->MP_NS_AHB6ENSETR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->MP_NS_AHB6ENSETR, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Check if non secure AHB6 peripheral clock is enabled or not
  * @rmtoll MP_NS_AHB6ENSETR      MDMA         LL_AHB6_NS_GRP1_EnableClock\n
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB6_NS_GRP1_PERIPH_MDMA
  * @retval State of Periphs (1 or 0).
  */
__STATIC_INLINE uint32_t LL_AHB6_NS_GRP1_IsEnabledClock(uint32_t Periphs)
{
  return ((READ_BIT(RCC->MP_NS_AHB6ENSETR, Periphs) == Periphs) ? 1U : 0U);
}

/**
  * @brief  Disable non secure AHB6 peripherals clock.
  * @rmtoll MP_NS_AHB6ENCLRR      MDMA         LL_AHB6_NS_GRP1_DisableClock\n
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB6_NS_GRP1_PERIPH_MDMA
  * @retval None
  */
__STATIC_INLINE void LL_AHB6_NS_GRP1_DisableClock(uint32_t Periphs)
{
  WRITE_REG(RCC->MP_NS_AHB6ENCLRR, Periphs);
}

/**
  * @brief  Enable non secure AHB6 peripheral clocks in Sleep mode
  * @rmtoll MP_NS_AHB6LPENSETR      MDMA         LL_AHB6_NS_GRP1_EnableClockSleep\n
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB6_NS_GRP1_PERIPH_MDMA
  * @retval None
  */
__STATIC_INLINE void LL_AHB6_NS_GRP1_EnableClockSleep(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  WRITE_REG(RCC->MP_NS_AHB6LPENSETR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->MP_NS_AHB6LPENSETR, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Disable non secure AHB6 peripheral clocks in Sleep mode
  * @rmtoll MP_NS_AHB6LPENCLRR      MDMA         LL_AHB6_NS_GRP1_DisableClockSleep\n
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB6_NS_GRP1_PERIPH_MDMA
  * @retval None
  */
__STATIC_INLINE void LL_AHB6_NS_GRP1_DisableClockSleep(uint32_t Periphs)
{
  WRITE_REG(RCC->MP_NS_AHB6LPENCLRR, Periphs);
}
/**
  * @}
  */

/** @defgroup BUS_LL_EF_AXI AXI
  * @{
  */

/**
  * @brief  Enable secure AXI peripheral clocks in Sleep mode
  * @rmtoll MP_S_AXIMLPENSETR    SYSRAMLPEN      LL_AXI_S_GRP1_EnableClockSleep
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AXI_S_GRP1_PERIPH_SYSRAMLPEN
  * @retval None
  */
__STATIC_INLINE void LL_AXI_S_GRP1_EnableClockSleep(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  WRITE_REG(RCC->MP_S_AXIMLPENSETR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->MP_S_AXIMLPENSETR, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Check if secure AXI peripheral clock is enabled or not
  * @rmtoll MP_S_AXIMLPENSETR      SYSRAMLPEN      LL_AXI_S_GRP1_IsEnabledClockSleep
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AXI_S_GRP1_PERIPH_SYSRAMLPEN
  * @retval State of Periphs (1 or 0).
  */
__STATIC_INLINE uint32_t LL_AXI_S_GRP1_IsEnabledClockSleep(uint32_t Periphs)
{
  return ((READ_BIT(RCC->MP_S_AXIMLPENSETR, Periphs) == Periphs) ? 1U : 0U);
}

/**
  * @brief  Disable secure AXI peripheral clocks in Sleep mode
  * @rmtoll MP_S_AXIMLPENCLRR    SYSRAMLPEN      LL_AXI_S_GRP1_DisableClockSleep
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AXI_S_GRP1_PERIPH_SYSRAMLPEN
  * @retval None
  */
__STATIC_INLINE void LL_AXI_S_GRP1_DisableClockSleep(uint32_t Periphs)
{
  WRITE_REG(RCC->MP_S_AXIMLPENCLRR, Periphs);
}

