zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/include/stm32mp13xx_ll_bus.h
/**
  * @brief  Enable non secure AXI peripheral clocks in Sleep mode
  * @rmtoll MP_NS_AXIMLPENSETR    SYSRAMLPEN      LL_AXI_NS_GRP1_EnableClockSleep
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AXI_NS_GRP1_PERIPH_SYSRAMLPEN
  * @retval None
  */
__STATIC_INLINE void LL_AXI_NS_GRP1_EnableClockSleep(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  WRITE_REG(RCC->MP_NS_AXIMLPENSETR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->MP_S_AXIMLPENSETR, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Check if non secure AXI peripheral clock in Sleep mode is enabled or not
  * @rmtoll MP_NS_AXIMLPENSETR      SYSRAMLPEN      LL_AXI_NS_GRP1_IsEnabledClockSleep
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AXI_NS_GRP1_PERIPH_SYSRAMLPEN
  * @retval State of Periphs (1 or 0).
  */
__STATIC_INLINE uint32_t LL_AXI_NS_GRP1_IsEnabledClockSleep(uint32_t Periphs)
{
  return ((READ_BIT(RCC->MP_NS_AXIMLPENSETR, Periphs) == Periphs) ? 1U : 0U);
}

/**
  * @brief  Disable non secure AXI peripheral clocks in Sleep mode
  * @rmtoll MP_NS_AXIMLPENCLRR    SYSRAMLPEN      LL_AXI_NS_GRP1_DisableClockSleep
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AXI_NS_GRP1_PERIPH_SYSRAMLPEN
  * @retval None
  */
__STATIC_INLINE void LL_AXI_NS_GRP1_DisableClockSleep(uint32_t Periphs)
{
  WRITE_REG(RCC->MP_NS_AXIMLPENCLRR, Periphs);
}
/**
  * @}
  */

/** @defgroup BUS_LL_EF_MLAHB MLAHB
  * @{
  */

/**
  * @brief  Enable MLAHB peripheral clocks in Sleep mode
  * @rmtoll MP_MLAHBLPENSETR    SRAM1LPEN         LL_MLAHB_GRP1_EnableClockSleep\n
  *         MP_MLAHBLPENSETR    SRAM2LPEN         LL_MLAHB_GRP1_EnableClockSleep\n
  *         MP_MLAHBLPENSETR    SRAM3LPEN         LL_MLAHB_GRP1_EnableClockSleep
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_MLAHB_GRP1_PERIPH_SRAM1LPEN
  *         @arg @ref LL_MLAHB_GRP1_PERIPH_SRAM2LPEN
  *         @arg @ref LL_MLAHB_GRP1_PERIPH_SRAM3LPEN
  * @retval None
  */
__STATIC_INLINE void LL_MLAHB_GRP1_EnableClockSleep(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  WRITE_REG(RCC->MP_MLAHBLPENSETR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->MP_MLAHBLPENSETR, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Check if MLAHB peripheral clock in Sleep mode is enabled or not
  * @rmtoll MP_MLAHBLPENSETR    SRAM1LPEN         LL_MLAHB_GRP1_IsEnabledClockSleep\n
  *         MP_MLAHBLPENSETR    SRAM2LPEN         LL_MLAHB_GRP1_IsEnabledClockSleep\n
  *         MP_MLAHBLPENSETR    SRAM3LPEN         LL_MLAHB_GRP1_IsEnabledClockSleep
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_MLAHB_GRP1_PERIPH_SRAM1LPEN
  *         @arg @ref LL_MLAHB_GRP1_PERIPH_SRAM2LPEN
  *         @arg @ref LL_MLAHB_GRP1_PERIPH_SRAM3LPEN
  * @retval State of Periphs (1 or 0).
  */
__STATIC_INLINE uint32_t LL_MLAHB_GRP1_IsEnabledClockSleep(uint32_t Periphs)
{
  return ((READ_BIT(RCC->MP_MLAHBLPENSETR, Periphs) == Periphs) ? 1U : 0U);
}

/**
  * @brief  Disable MLAHB peripheral clocks in Sleep mode
  * @rmtoll MP_MLAHBLPENCLRR    SRAM1LPEN         LL_MLAHB_GRP1_DisableClockSleep\n
  *         MP_MLAHBLPENCLRR    SRAM2LPEN         LL_MLAHB_GRP1_DisableClockSleep\n
  *         MP_MLAHBLPENCLRR    SRAM3LPEN         LL_MLAHB_GRP1_DisableClockSleep
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_MLAHB_GRP1_PERIPH_SRAM1LPEN
  *         @arg @ref LL_MLAHB_GRP1_PERIPH_SRAM2LPEN
  *         @arg @ref LL_MLAHB_GRP1_PERIPH_SRAM3LPEN
  * @retval None
  */
__STATIC_INLINE void LL_MLAHB_GRP1_DisableClockSleep(uint32_t Periphs)
{
  WRITE_REG(RCC->MP_MLAHBLPENCLRR, Periphs);
}

/**
  * @}
  */

/** @defgroup BUS_LL_EF_APB1 APB1
  * @{
  */

/**
  * @brief  Enable APB1 peripherals clock.
  * @rmtoll MP_APB1ENSETR      TIM2       LL_APB1_GRP1_EnableClock\n
  *         MP_APB1ENSETR      TIM3       LL_APB1_GRP1_EnableClock\n
  *         MP_APB1ENSETR      TIM4       LL_APB1_GRP1_EnableClock\n
  *         MP_APB1ENSETR      TIM5       LL_APB1_GRP1_EnableClock\n
  *         MP_APB1ENSETR      TIM6       LL_APB1_GRP1_EnableClock\n
  *         MP_APB1ENSETR      TIM7       LL_APB1_GRP1_EnableClock\n
  *         MP_APB1ENSETR      LPTIM1     LL_APB1_GRP1_EnableClock\n
  *         MP_APB1ENSETR      SPI2       LL_APB1_GRP1_EnableClock\n
  *         MP_APB1ENSETR      SPI3       LL_APB1_GRP1_EnableClock\n
  *         MP_APB1ENSETR      USART3     LL_APB1_GRP1_EnableClock\n
  *         MP_APB1ENSETR      UART4      LL_APB1_GRP1_EnableClock\n
  *         MP_APB1ENSETR      UART5      LL_APB1_GRP1_EnableClock\n
  *         MP_APB1ENSETR      UART7      LL_APB1_GRP1_EnableClock\n
  *         MP_APB1ENSETR      UART8      LL_APB1_GRP1_EnableClock\n
  *         MP_APB1ENSETR      I2C1       LL_APB1_GRP1_EnableClock\n
  *         MP_APB1ENSETR      I2C2       LL_APB1_GRP1_EnableClock\n
  *         MP_APB1ENSETR      SPDIF      LL_APB1_GRP1_EnableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM2
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM3
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM4
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM5
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM6
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM7
  *         @arg @ref LL_APB1_GRP1_PERIPH_LPTIM1
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI2
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI3
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART3
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART4
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART5
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART7
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART8
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C1
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C2
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPDIF
  * @retval None
  */
__STATIC_INLINE void LL_APB1_GRP1_EnableClock(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  WRITE_REG(RCC->MP_APB1ENSETR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->MP_APB1ENSETR, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Check if APB1 peripheral clock is enabled or not
  * @rmtoll MP_APB1ENSETR      TIM2       LL_APB1_GRP1_IsEnabledClock\n
  *         MP_APB1ENSETR      TIM3       LL_APB1_GRP1_IsEnabledClock\n
  *         MP_APB1ENSETR      TIM4       LL_APB1_GRP1_IsEnabledClock\n
  *         MP_APB1ENSETR      TIM5       LL_APB1_GRP1_IsEnabledClock\n
  *         MP_APB1ENSETR      TIM6       LL_APB1_GRP1_IsEnabledClock\n
  *         MP_APB1ENSETR      TIM7       LL_APB1_GRP1_IsEnabledClock\n
  *         MP_APB1ENSETR      LPTIM1     LL_APB1_GRP1_IsEnabledClock\n
  *         MP_APB1ENSETR      SPI2       LL_APB1_GRP1_IsEnabledClock\n
  *         MP_APB1ENSETR      SPI3       LL_APB1_GRP1_IsEnabledClock\n
  *         MP_APB1ENSETR      USART3     LL_APB1_GRP1_IsEnabledClock\n
  *         MP_APB1ENSETR      UART4      LL_APB1_GRP1_IsEnabledClock\n
  *         MP_APB1ENSETR      UART5      LL_APB1_GRP1_IsEnabledClock\n
  *         MP_APB1ENSETR      UART7      LL_APB1_GRP1_IsEnabledClock\n
  *         MP_APB1ENSETR      UART8      LL_APB1_GRP1_IsEnabledClock\n
  *         MP_APB1ENSETR      I2C1       LL_APB1_GRP1_IsEnabledClock\n
  *         MP_APB1ENSETR      I2C2       LL_APB1_GRP1_IsEnabledClock\n
  *         MP_APB1ENSETR      SPDIF      LL_APB1_GRP1_IsEnabledClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM2
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM3
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM4
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM5
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM6
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM7
  *         @arg @ref LL_APB1_GRP1_PERIPH_LPTIM1
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI2
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI3
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART3
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART4
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART5
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART7
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART8
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C1
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C2
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPDIF
  * @retval State of Periphs (1 or 0).
  */
__STATIC_INLINE uint32_t LL_APB1_GRP1_IsEnabledClock(uint32_t Periphs)
{
  return ((READ_BIT(RCC->MP_APB1ENSETR, Periphs) == Periphs) ? 1U : 0U);
}

/**
  * @brief  Disable APB1 peripherals clock.
  * @rmtoll MP_APB1ENCLRR      TIM2       LL_APB1_GRP1_DisableClock\n
  *         MP_APB1ENCLRR      TIM3       LL_APB1_GRP1_DisableClock\n
  *         MP_APB1ENCLRR      TIM4       LL_APB1_GRP1_DisableClock\n
  *         MP_APB1ENCLRR      TIM5       LL_APB1_GRP1_DisableClock\n
  *         MP_APB1ENCLRR      TIM6       LL_APB1_GRP1_DisableClock\n
  *         MP_APB1ENCLRR      TIM7       LL_APB1_GRP1_DisableClock\n
  *         MP_APB1ENCLRR      LPTIM1     LL_APB1_GRP1_DisableClock\n
  *         MP_APB1ENCLRR      SPI2       LL_APB1_GRP1_DisableClock\n
  *         MP_APB1ENCLRR      SPI3       LL_APB1_GRP1_DisableClock\n
  *         MP_APB1ENCLRR      USART3     LL_APB1_GRP1_DisableClock\n
  *         MP_APB1ENCLRR      UART4      LL_APB1_GRP1_DisableClock\n
  *         MP_APB1ENCLRR      UART5      LL_APB1_GRP1_DisableClock\n
  *         MP_APB1ENCLRR      UART7      LL_APB1_GRP1_DisableClock\n
  *         MP_APB1ENCLRR      UART8      LL_APB1_GRP1_DisableClock\n
  *         MP_APB1ENCLRR      I2C1       LL_APB1_GRP1_DisableClock\n
  *         MP_APB1ENCLRR      I2C2       LL_APB1_GRP1_DisableClock\n
  *         MP_APB1ENCLRR      SPDIF      LL_APB1_GRP1_DisableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM2
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM3
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM4
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM5
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM6
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM7
  *         @arg @ref LL_APB1_GRP1_PERIPH_LPTIM1
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI2
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI3
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART3
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART4
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART5
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART7
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART8
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C1
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C2
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPDIF
  * @retval None
  */
__STATIC_INLINE void LL_APB1_GRP1_DisableClock(uint32_t Periphs)
{
  WRITE_REG(RCC->MP_APB1ENCLRR, Periphs);
}

/**
  * @brief  Force APB1 peripherals reset.
  * @rmtoll APB1RSTSETR     TIM2       LL_APB1_GRP1_ForceReset\n
  *         APB1RSTSETR     TIM3       LL_APB1_GRP1_ForceReset\n
  *         APB1RSTSETR     TIM4       LL_APB1_GRP1_ForceReset\n
  *         APB1RSTSETR     TIM5       LL_APB1_GRP1_ForceReset\n
  *         APB1RSTSETR     TIM6       LL_APB1_GRP1_ForceReset\n
  *         APB1RSTSETR     TIM7       LL_APB1_GRP1_ForceReset\n
  *         APB1RSTSETR     LPTIM1     LL_APB1_GRP1_ForceReset\n
  *         APB1RSTSETR     SPI2       LL_APB1_GRP1_ForceReset\n
  *         APB1RSTSETR     SPI3       LL_APB1_GRP1_ForceReset\n
  *         APB1RSTSETR     USART3     LL_APB1_GRP1_ForceReset\n
  *         APB1RSTSETR     UART4      LL_APB1_GRP1_ForceReset\n
  *         APB1RSTSETR     UART5      LL_APB1_GRP1_ForceReset\n
  *         APB1RSTSETR     UART7      LL_APB1_GRP1_ForceReset\n
  *         APB1RSTSETR     UART8      LL_APB1_GRP1_ForceReset\n
  *         APB1RSTSETR     I2C1       LL_APB1_GRP1_ForceReset\n
  *         APB1RSTSETR     I2C2       LL_APB1_GRP1_ForceReset\n
  *         APB1RSTSETR     SPDIF      LL_APB1_GRP1_ForceReset
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP1_PERIPH_ALL
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM2
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM3
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM4
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM5
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM6
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM7
  *         @arg @ref LL_APB1_GRP1_PERIPH_LPTIM1
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI2
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI3
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART3
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART4
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART5
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART7
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART8
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C1
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C2
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPDIF
  * @retval None
  */
__STATIC_INLINE void LL_APB1_GRP1_ForceReset(uint32_t Periphs)
{
  WRITE_REG(RCC->APB1RSTSETR, Periphs);
}

/**
  * @brief  Release APB1 peripherals reset.
  * @rmtoll APB1RSTCLRR     TIM2       LL_APB1_GRP1_ReleaseReset\n
  *         APB1RSTCLRR     TIM3       LL_APB1_GRP1_ReleaseReset\n
  *         APB1RSTCLRR     TIM4       LL_APB1_GRP1_ReleaseReset\n
  *         APB1RSTCLRR     TIM5       LL_APB1_GRP1_ReleaseReset\n
  *         APB1RSTCLRR     TIM6       LL_APB1_GRP1_ReleaseReset\n
  *         APB1RSTCLRR     TIM7       LL_APB1_GRP1_ReleaseReset\n
  *         APB1RSTCLRR     LPTIM1     LL_APB1_GRP1_ReleaseReset\n
  *         APB1RSTCLRR     SPI2       LL_APB1_GRP1_ReleaseReset\n
  *         APB1RSTCLRR     SPI3       LL_APB1_GRP1_ReleaseReset\n
  *         APB1RSTCLRR     USART3     LL_APB1_GRP1_ReleaseReset\n
  *         APB1RSTCLRR     UART4      LL_APB1_GRP1_ReleaseReset\n
  *         APB1RSTCLRR     UART5      LL_APB1_GRP1_ReleaseReset\n
  *         APB1RSTCLRR     UART7      LL_APB1_GRP1_ReleaseReset\n
  *         APB1RSTCLRR     UART8      LL_APB1_GRP1_ReleaseReset\n
  *         APB1RSTCLRR     I2C1       LL_APB1_GRP1_ReleaseReset\n
  *         APB1RSTCLRR     I2C2       LL_APB1_GRP1_ReleaseReset\n
  *         APB1RSTCLRR     SPDIF      LL_APB1_GRP1_ReleaseReset
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP1_PERIPH_ALL
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM2
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM3
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM4
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM5
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM6
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM7
  *         @arg @ref LL_APB1_GRP1_PERIPH_LPTIM1
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI2
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI3
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART3
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART4
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART5
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART7
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART8
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C1
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C2
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPDIF
  * @retval None
  */
__STATIC_INLINE void LL_APB1_GRP1_ReleaseReset(uint32_t Periphs)
{
  WRITE_REG(RCC->APB1RSTCLRR, Periphs);
}

/**
  * @brief  Enable APB1 peripheral clocks in Sleep mode
  * @rmtoll MP_APB1LPENSETR    TIM2       LL_APB1_GRP1_EnableClockSleep\n
  *         MP_APB1LPENSETR    TIM3       LL_APB1_GRP1_EnableClockSleep\n
  *         MP_APB1LPENSETR    TIM4       LL_APB1_GRP1_EnableClockSleep\n
  *         MP_APB1LPENSETR    TIM5       LL_APB1_GRP1_EnableClockSleep\n
  *         MP_APB1LPENSETR    TIM6       LL_APB1_GRP1_EnableClockSleep\n
  *         MP_APB1LPENSETR    TIM7       LL_APB1_GRP1_EnableClockSleep\n
  *         MP_APB1LPENSETR    LPTIM1     LL_APB1_GRP1_EnableClockSleep\n
  *         MP_APB1LPENSETR    SPI2       LL_APB1_GRP1_EnableClockSleep\n
  *         MP_APB1LPENSETR    SPI3       LL_APB1_GRP1_EnableClockSleep\n
  *         MP_APB1LPENSETR    USART3     LL_APB1_GRP1_EnableClockSleep\n
  *         MP_APB1LPENSETR    UART4      LL_APB1_GRP1_EnableClockSleep\n
  *         MP_APB1LPENSETR    UART5      LL_APB1_GRP1_EnableClockSleep\n
  *         MP_APB1LPENSETR    UART7      LL_APB1_GRP1_EnableClockSleep\n
  *         MP_APB1LPENSETR    UART8      LL_APB1_GRP1_EnableClockSleep\n
  *         MP_APB1LPENSETR    I2C1       LL_APB1_GRP1_EnableClockSleep\n
  *         MP_APB1LPENSETR    I2C2       LL_APB1_GRP1_EnableClockSleep\n
  *         MP_APB1LPENSETR    SPDIF      LL_APB1_GRP1_EnableClockSleep
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM2
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM3
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM4
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM5
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM6
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM7
  *         @arg @ref LL_APB1_GRP1_PERIPH_LPTIM1
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI2
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI3
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART3
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART4
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART5
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART7
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART8
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C1
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C2
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPDIF
  * @retval None
  */
__STATIC_INLINE void LL_APB1_GRP1_EnableClockSleep(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  WRITE_REG(RCC->MP_APB1LPENSETR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->MP_APB1LPENSETR, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Disable APB1 peripheral clocks in Sleep mode
  * @rmtoll MP_APB1LPENCLRR    TIM2       LL_APB1_GRP1_DisableClockSleep\n
  *         MP_APB1LPENCLRR    TIM3       LL_APB1_GRP1_DisableClockSleep\n
  *         MP_APB1LPENCLRR    TIM4       LL_APB1_GRP1_DisableClockSleep\n
  *         MP_APB1LPENCLRR    TIM5       LL_APB1_GRP1_DisableClockSleep\n
  *         MP_APB1LPENCLRR    TIM6       LL_APB1_GRP1_DisableClockSleep\n
  *         MP_APB1LPENCLRR    TIM7       LL_APB1_GRP1_DisableClockSleep\n
  *         MP_APB1LPENCLRR    LPTIM1     LL_APB1_GRP1_DisableClockSleep\n
  *         MP_APB1LPENCLRR    SPI2       LL_APB1_GRP1_DisableClockSleep\n
  *         MP_APB1LPENCLRR    SPI3       LL_APB1_GRP1_DisableClockSleep\n
  *         MP_APB1LPENCLRR    USART3     LL_APB1_GRP1_DisableClockSleep\n
  *         MP_APB1LPENCLRR    UART4      LL_APB1_GRP1_DisableClockSleep\n
  *         MP_APB1LPENCLRR    UART5      LL_APB1_GRP1_DisableClockSleep\n
  *         MP_APB1LPENCLRR    UART7      LL_APB1_GRP1_DisableClockSleep\n
  *         MP_APB1LPENCLRR    UART8      LL_APB1_GRP1_DisableClockSleep\n
  *         MP_APB1LPENCLRR    I2C1       LL_APB1_GRP1_DisableClockSleep\n
  *         MP_APB1LPENCLRR    I2C2       LL_APB1_GRP1_DisableClockSleep\n
  *         MP_APB1LPENCLRR    SPDIF      LL_APB1_GRP1_DisableClockSleep
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM2
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM3
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM4
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM5
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM6
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM7
  *         @arg @ref LL_APB1_GRP1_PERIPH_LPTIM1
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI2
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI3
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART3
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART4
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART5
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART7
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART8
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C1
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C2
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPDIF
  * @retval None
  */
__STATIC_INLINE void LL_APB1_GRP1_DisableClockSleep(uint32_t Periphs)
{
  WRITE_REG(RCC->MP_APB1LPENCLRR, Periphs);
}

/**
  * @}
  */

/** @defgroup BUS_LL_EF_APB2 APB2
  * @{
  */

/**
  * @brief  Enable APB2 peripherals clock.
  * @rmtoll MP_APB2ENSETR      TIM1       LL_APB2_GRP1_EnableClock\n
  *         MP_APB2ENSETR      TIM8       LL_APB2_GRP1_EnableClock\n
  *         MP_APB2ENSETR      SPI1       LL_APB2_GRP1_EnableClock\n
  *         MP_APB2ENSETR      USART6     LL_APB2_GRP1_EnableClock\n
  *         MP_APB2ENSETR      SAI1       LL_APB2_GRP1_EnableClock\n
  *         MP_APB2ENSETR      SAI2       LL_APB2_GRP1_EnableClock\n
  *         MP_APB2ENSETR      DFSDM1     LL_APB2_GRP1_EnableClock\n
  *         MP_APB2ENSETR      ADFSDM1    LL_APB2_GRP1_EnableClock\n
  *         MP_APB2ENSETR      FDCAN      LL_APB2_GRP1_EnableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM1
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM8
  *         @arg @ref LL_APB2_GRP1_PERIPH_SPI1
  *         @arg @ref LL_APB2_GRP1_PERIPH_USART6
  *         @arg @ref LL_APB2_GRP1_PERIPH_SAI1
  *         @arg @ref LL_APB2_GRP1_PERIPH_SAI2
  *         @arg @ref LL_APB2_GRP1_PERIPH_DFSDM1
  *         @arg @ref LL_APB2_GRP1_PERIPH_ADFSDM1
  *         @arg @ref LL_APB2_GRP1_PERIPH_FDCAN
  * @retval None
  */
__STATIC_INLINE void LL_APB2_GRP1_EnableClock(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  WRITE_REG(RCC->MP_APB2ENSETR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->MP_APB2ENSETR, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Check if APB2 peripheral clock is enabled or not
  * @rmtoll MP_APB2ENSETR      TIM1       LL_APB2_GRP1_IsEnabledClock\n
  *         MP_APB2ENSETR      TIM8       LL_APB2_GRP1_IsEnabledClock\n
  *         MP_APB2ENSETR      SPI1       LL_APB2_GRP1_IsEnabledClock\n
  *         MP_APB2ENSETR      USART6     LL_APB2_GRP1_IsEnabledClock\n
  *         MP_APB2ENSETR      SAI1       LL_APB2_GRP1_IsEnabledClock\n
  *         MP_APB2ENSETR      SAI2       LL_APB2_GRP1_IsEnabledClock\n
  *         MP_APB2ENSETR      DFSDM1     LL_APB2_GRP1_IsEnabledClock\n
  *         MP_APB2ENSETR      ADFSDM1    LL_APB2_GRP1_IsEnabledClock\n
  *         MP_APB2ENSETR      FDCAN      LL_APB2_GRP1_IsEnabledClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM1
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM8
  *         @arg @ref LL_APB2_GRP1_PERIPH_SPI1
  *         @arg @ref LL_APB2_GRP1_PERIPH_USART6
  *         @arg @ref LL_APB2_GRP1_PERIPH_SAI1
  *         @arg @ref LL_APB2_GRP1_PERIPH_SAI2
  *         @arg @ref LL_APB2_GRP1_PERIPH_DFSDM1
  *         @arg @ref LL_APB2_GRP1_PERIPH_ADFSDM1
  *         @arg @ref LL_APB2_GRP1_PERIPH_FDCAN
  * @retval State of Periphs (1 or 0).
  */
__STATIC_INLINE uint32_t LL_APB2_GRP1_IsEnabledClock(uint32_t Periphs)
{
  return ((READ_BIT(RCC->MP_APB2ENSETR, Periphs) == Periphs) ? 1U : 0U);
}

