zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/include/stm32mp13xx_ll_bus.h
/** @defgroup BUS_LL_EF_APB3_NS APB3_NS
  * @{
  */

/**
  * @brief  Enable non secure APB3 peripherals clock.
  * @rmtoll MP_NS_APB3ENSETR      SYSCFG     LL_APB3_NS_GRP1_EnableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB3_S_GRP1_PERIPH_SYSCFG
  * @retval None
  */
__STATIC_INLINE void LL_APB3_NS_GRP1_EnableClock(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  WRITE_REG(RCC->MP_NS_APB3ENSETR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->MP_NS_APB3ENSETR, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Check if non secure APB3 peripheral clock is enabled or not
  * @rmtoll MP_NS_APB3ENSETR      SYSCFG      LL_APB3_NS_GRP1_IsEnabledClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB3_S_GRP1_PERIPH_SYSCFG
  * @retval State of Periphs (1 or 0).
  */
__STATIC_INLINE uint32_t LL_APB3_NS_GRP1_IsEnabledClock(uint32_t Periphs)
{
  return ((READ_BIT(RCC->MP_NS_APB3ENSETR, Periphs) == Periphs) ? 1U : 0U);
}

/**
  * @brief  Disable non secure APB3 peripherals clock.
  * @rmtoll MP_NS_APB3ENCLRR      SYSCFG      LL_APB3_NS_GRP1_DisableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB3_S_GRP1_PERIPH_SYSCFG
  * @retval None
  */
__STATIC_INLINE void LL_APB3_NS_GRP1_DisableClock(uint32_t Periphs)
{
  WRITE_REG(RCC->MP_NS_APB3ENCLRR, Periphs);
}

/**
  * @brief  Enable non secure APB3 peripheral clocks in Sleep mode
  * @rmtoll MP_NS_APB3LPENSETR    SYSCFG       LL_APB3_NS_GRP1_EnableClockSleep
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB3_S_GRP1_PERIPH_SYSCFG
  * @retval None
  */
__STATIC_INLINE void LL_APB3_NS_GRP1_EnableClockSleep(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  WRITE_REG(RCC->MP_NS_APB3LPENSETR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->MP_NS_APB3LPENSETR, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Disable non secure APB3 peripheral clocks in Sleep mode
  * @rmtoll MP_NS_APB3LPENCLRR    SYSCFG      LL_APB3_NS_GRP1_DisableClockSleep
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB3_S_GRP1_PERIPH_SYSCFG
  * @retval None
  */
__STATIC_INLINE void LL_APB3_NS_GRP1_DisableClockSleep(uint32_t Periphs)
{
  WRITE_REG(RCC->MP_NS_APB3LPENCLRR, Periphs);
}
/**
  * @}
  */

/** @defgroup BUS_LL_EF_APB4 APB4
  * @{
  */

/**
  * @brief  Enable APB4 peripherals clock.
  * @rmtoll MP_APB4ENSETR      DCMIPP       LL_APB4_GRP1_EnableClock\n
  *         MP_APB4ENSETR      DDRPERFM     LL_APB4_GRP1_EnableClock\n
  *         MP_APB4ENSETR      IWDG2        LL_APB4_GRP1_EnableClock\n
  *         MP_APB4ENSETR      USBPHY       LL_APB4_GRP1_EnableClock\n
  *         MP_APB4ENSETR      STGENRO      LL_APB4_GRP1_EnableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB4_GRP1_PERIPH_DCMIPP
  *         @arg @ref LL_APB4_GRP1_PERIPH_DDRPERFM
  *         @arg @ref LL_APB4_GRP1_PERIPH_IWDG2
  *         @arg @ref LL_APB4_GRP1_PERIPH_USBPHY
  *         @arg @ref LL_APB4_GRP1_PERIPH_STGENRO
  * @retval None
  */
__STATIC_INLINE void LL_APB4_GRP1_EnableClock(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  WRITE_REG(RCC->MP_APB4ENSETR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->MP_APB4ENSETR, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Check if APB4 peripheral clock is enabled or not
  * @rmtoll MP_APB4ENSETR      DCMIPP        LL_APB4_GRP1_IsEnabledClock\n
  *         MP_APB4ENSETR      DDRPERFM      LL_APB4_GRP1_IsEnabledClock\n
  *         MP_APB4ENSETR      IWDG2         LL_APB4_GRP1_IsEnabledClock\n
  *         MP_APB4ENSETR      USBPHY        LL_APB4_GRP1_IsEnabledClock\n
  *         MP_APB4ENSETR      STGENRO       LL_APB4_GRP1_IsEnabledClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB4_GRP1_PERIPH_DCMIPP
  *         @arg @ref LL_APB4_GRP1_PERIPH_DDRPERFM
  *         @arg @ref LL_APB4_GRP1_PERIPH_IWDG2
  *         @arg @ref LL_APB4_GRP1_PERIPH_USBPHY
  *         @arg @ref LL_APB4_GRP1_PERIPH_STGENRO
  * @retval State of Periphs (1 or 0).
  */
__STATIC_INLINE uint32_t LL_APB4_GRP1_IsEnabledClock(uint32_t Periphs)
{
  return ((READ_BIT(RCC->MP_APB4ENSETR, Periphs) == Periphs) ? 1U : 0U);
}

/**
  * @brief  Disable APB4 peripherals clock.
  * @rmtoll MP_APB4ENCLRR      DCMIPP        LL_APB4_GRP1_DisableClock\n
  *         MP_APB4ENCLRR      DDRPERFM      LL_APB4_GRP1_DisableClock\n
  *         MP_APB4ENCLRR      IWDG2         LL_APB4_GRP1_DisableClock\n
  *         MP_APB4ENCLRR      USBPHY        LL_APB4_GRP1_DisableClock\n
  *         MP_APB4ENCLRR      STGENRO       LL_APB4_GRP1_DisableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB4_GRP1_PERIPH_DCMIPP
  *         @arg @ref LL_APB4_GRP1_PERIPH_DDRPERFM
  *         @arg @ref LL_APB4_GRP1_PERIPH_IWDG2
  *         @arg @ref LL_APB4_GRP1_PERIPH_USBPHY
  *         @arg @ref LL_APB4_GRP1_PERIPH_STGENRO
  * @retval None
  */
__STATIC_INLINE void LL_APB4_GRP1_DisableClock(uint32_t Periphs)
{
  WRITE_REG(RCC->MP_APB4ENCLRR, Periphs);
}

/**
  * @brief  Force APB4 peripherals reset.
  * @rmtoll APB4RSTSETR     LTDC           LL_APB4_GRP1_ForceReset\n
  *         APB4RSTSETR     DCMIPP         LL_APB4_GRP1_ForceReset\n
  *         APB4RSTSETR     DDRPERFM       LL_APB4_GRP1_ForceReset\n
  *         APB4RSTSETR     USBPHY         LL_APB4_GRP1_ForceReset
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB4_GRP1_PERIPH_ALL
  *         @arg @ref LL_APB4_S_GRP1_PERIPH_LTDC
  *         @arg @ref LL_APB4_GRP1_PERIPH_DCMIPP
  *         @arg @ref LL_APB4_GRP1_PERIPH_DDRPERFM
  *         @arg @ref LL_APB4_GRP1_PERIPH_USBPHY
  * @retval None
  */
__STATIC_INLINE void LL_APB4_GRP1_ForceReset(uint32_t Periphs)
{
  WRITE_REG(RCC->APB4RSTSETR, Periphs);
}

/**
  * @brief  Release APB4 peripherals reset.
  * @rmtoll APB4RSTCLRR     LTDC           LL_APB4_GRP1_ReleaseReset\n
  *         APB4RSTCLRR     DCMIPP         LL_APB4_GRP1_ReleaseReset\n
  *         APB4RSTCLRR     DDRPERFM       LL_APB4_GRP1_ReleaseReset\n
  *         APB4RSTCLRR     USBPHY         LL_APB4_GRP1_ReleaseReset
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB4_GRP1_PERIPH_ALL
  *         @arg @ref LL_APB4_S_GRP1_PERIPH_LTDC
  *         @arg @ref LL_APB4_GRP1_PERIPH_DCMIPP
  *         @arg @ref LL_APB4_GRP1_PERIPH_DDRPERFM
  *         @arg @ref LL_APB4_GRP1_PERIPH_USBPHY
  * @retval None
  */
__STATIC_INLINE void LL_APB4_GRP1_ReleaseReset(uint32_t Periphs)
{
  WRITE_REG(RCC->APB4RSTCLRR, Periphs);
}

/**
  * @brief  Enable APB4 peripheral clocks in Sleep mode
  * @rmtoll MP_APB4LPENSETR    DCMIPP         LL_APB4_GRP1_EnableClockSleep\n
  *         MP_APB4LPENSETR    DDRPERFM       LL_APB4_GRP1_EnableClockSleep\n
  *         MP_APB4LPENSETR    IWDG2          LL_APB4_GRP1_EnableClockSleep\n
  *         MP_APB4LPENSETR    USBPHY         LL_APB4_GRP1_EnableClockSleep\n
  *         MP_APB4LPENSETR    STGENRO        LL_APB4_GRP1_EnableClockSleep
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB4_GRP1_PERIPH_DCMIPP
  *         @arg @ref LL_APB4_GRP1_PERIPH_DDRPERFM
  *         @arg @ref LL_APB4_GRP1_PERIPH_IWDG2
  *         @arg @ref LL_APB4_GRP1_PERIPH_USBPHY
  *         @arg @ref LL_APB4_GRP1_PERIPH_STGENRO
  * @retval None
  */
__STATIC_INLINE void LL_APB4_GRP1_EnableClockSleep(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  WRITE_REG(RCC->MP_APB4LPENSETR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->MP_APB4LPENSETR, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Disable APB4 peripheral clocks in Sleep mode
  * @rmtoll MP_APB4LPENCLRR    DCMIPP        LL_APB4_GRP1_DisableClockSleep\n
  *         MP_APB4LPENCLRR    DDRPERFM      LL_APB4_GRP1_DisableClockSleep\n
  *         MP_APB4LPENCLRR    IWDG2         LL_APB4_GRP1_DisableClockSleep\n
  *         MP_APB4LPENCLRR    USBPHY        LL_APB4_GRP1_DisableClockSleep\n
  *         MP_APB4LPENCLRR    STGENRO       LL_APB4_GRP1_DisableClockSleep
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB4_GRP1_PERIPH_DCMIPP
  *         @arg @ref LL_APB4_GRP1_PERIPH_DDRPERFM
  *         @arg @ref LL_APB4_GRP1_PERIPH_IWDG2
  *         @arg @ref LL_APB4_GRP1_PERIPH_USBPHY
  *         @arg @ref LL_APB4_GRP1_PERIPH_STGENRO
  * @retval None
  */
__STATIC_INLINE void LL_APB4_GRP1_DisableClockSleep(uint32_t Periphs)
{
  WRITE_REG(RCC->MP_APB4LPENCLRR, Periphs);
}

/**
  * @brief  Enable APB4 peripheral clocks in Stop mode
  * @rmtoll MP_APB4LPENSETR    STGENROSTPEN           LL_APB4_GRP1_EnableClockStop
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB4_GRP1_PERIPH_STGENROSTP
  * @retval None
  */
__STATIC_INLINE void LL_APB4_GRP1_EnableClockStop(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  WRITE_REG(RCC->MP_APB4LPENSETR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->MP_APB4LPENSETR, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Disable APB4 peripheral clocks in Stop modes
  * @rmtoll MP_APB4LPENCLRR    STGENROSTPEN          LL_APB4_GRP1_DisableClockStop
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB4_GRP1_PERIPH_STGENROSTP
  * @retval None
  */
__STATIC_INLINE void LL_APB4_GRP1_DisableClockStop(uint32_t Periphs)
{
  WRITE_REG(RCC->MP_APB4LPENCLRR, Periphs);
}
/**
  * @}
  */

/** @defgroup BUS_LL_EF_APB4_S APB4_S
  * @{
  */

/**
  * @brief  Enable secure APB4 peripherals clock.
  * @rmtoll MP_S_APB4ENSETR      LTDC         LL_APB4_S_GRP1_EnableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB4_S_GRP1_PERIPH_LTDC
  * @retval None
  */
__STATIC_INLINE void LL_APB4_S_GRP1_EnableClock(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  WRITE_REG(RCC->MP_S_APB4ENSETR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->MP_S_APB4ENSETR, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Check if secure APB4 peripheral clock is enabled or not
  * @rmtoll MP_S_APB4ENSETR      LTDC          LL_APB4_S_GRP1_IsEnabledClock
  * @param  Periphs This parameter can be a combination of the following values:
  * @retval State of Periphs (1 or 0).
  */
__STATIC_INLINE uint32_t LL_APB4_S_GRP1_IsEnabledClock(uint32_t Periphs)
{
  return ((READ_BIT(RCC->MP_S_APB4ENSETR, Periphs) == Periphs) ? 1U : 0U);
}

/**
  * @brief  Disable secure APB4 peripherals clock.
  * @rmtoll MP_S_APB4ENCLRR      LTDC          LL_APB4_S_GRP1_DisableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB4_S_GRP1_PERIPH_LTDC
  * @retval None
  */
__STATIC_INLINE void LL_APB4_S_GRP1_DisableClock(uint32_t Periphs)
{
  WRITE_REG(RCC->MP_S_APB4ENCLRR, Periphs);
}

/**
  * @brief  Enable secure APB4 peripheral clocks in Sleep mode
  * @rmtoll MP_S_APB4LPENSETR    LTDC           LL_APB4_S_GRP1_EnableClockSleep
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB4_S_GRP1_PERIPH_LTDC
  * @retval None
  */
__STATIC_INLINE void LL_APB4_S_GRP1_EnableClockSleep(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  WRITE_REG(RCC->MP_S_APB4LPENSETR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->MP_S_APB4LPENSETR, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Disable secure APB4 peripheral clocks in Sleep mode
  * @rmtoll MP_S_APB4LPENCLRR    LTDC          LL_APB4_S_GRP1_DisableClockSleep
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB4_S_GRP1_PERIPH_LTDC
  * @retval None
  */
__STATIC_INLINE void LL_APB4_S_GRP1_DisableClockSleep(uint32_t Periphs)
{
  WRITE_REG(RCC->MP_S_APB4LPENCLRR, Periphs);
}
/**
  * @}
  */

/** @defgroup BUS_LL_EF_APB4_NS APB4_NS
  * @{
  */

/**
  * @brief  Enable non secure APB4 peripherals clock.
  * @rmtoll MP_NS_APB4ENSETR      LTDC         LL_APB4_NS_GRP1_EnableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB4_NS_GRP1_PERIPH_LTDC
  * @retval None
  */
__STATIC_INLINE void LL_APB4_NS_GRP1_EnableClock(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  WRITE_REG(RCC->MP_NS_APB4ENSETR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->MP_NS_APB4ENSETR, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Check if non secure APB4 peripheral clock is enabled or not
  * @rmtoll MP_NS_APB4ENSETR      LTDC          LL_APB4_NS_GRP1_IsEnabledClock
  * @param  Periphs This parameter can be a combination of the following values:
  * @retval State of Periphs (1 or 0).
  */
__STATIC_INLINE uint32_t LL_APB4_NS_GRP1_IsEnabledClock(uint32_t Periphs)
{
  return ((READ_BIT(RCC->MP_NS_APB4ENSETR, Periphs) == Periphs) ? 1U : 0U);
}

/**
  * @brief  Disable non secure APB4 peripherals clock.
  * @rmtoll MP_NS_APB4ENCLRR      LTDC          LL_APB4_NS_GRP1_DisableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB4_NS_GRP1_PERIPH_LTDC
  * @retval None
  */
__STATIC_INLINE void LL_APB4_NS_GRP1_DisableClock(uint32_t Periphs)
{
  WRITE_REG(RCC->MP_NS_APB4ENCLRR, Periphs);
}

/**
  * @brief  Enable non secure APB4 peripheral clocks in Sleep mode
  * @rmtoll MP_NS_APB4LPENSETR    LTDC           LL_APB4_NS_GRP1_EnableClockSleep
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB4_NS_GRP1_PERIPH_LTDC
  * @retval None
  */
__STATIC_INLINE void LL_APB4_NS_GRP1_EnableClockSleep(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  WRITE_REG(RCC->MP_NS_APB4LPENSETR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->MP_NS_APB4LPENSETR, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Disable non secure APB4 peripheral clocks in Sleep mode
  * @rmtoll MP_NS_APB4LPENCLRR    LTDC          LL_APB4_NS_GRP1_DisableClockSleep
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB4_NS_GRP1_PERIPH_LTDC
  * @retval None
  */
__STATIC_INLINE void LL_APB4_NS_GRP1_DisableClockSleep(uint32_t Periphs)
{
  WRITE_REG(RCC->MP_NS_APB4LPENCLRR, Periphs);
}
/**
  * @}
  */

/** @defgroup BUS_LL_EF_APB5 APB5
  * @{
  */

/**
  * @brief  Enable APB5 peripherals clock.
  * @rmtoll MP_APB5ENSETR      RTCAPB       LL_APB5_GRP1_EnableClock\n
  *         MP_APB5ENSETR      TZC          LL_APB5_GRP1_EnableClock\n
  *         MP_APB5ENSETR      ETZC         LL_APB5_GRP1_EnableClock\n
  *         MP_APB5ENSETR      IWDG1        LL_APB5_GRP1_EnableClock\n
  *         MP_APB5ENSETR      BSEC         LL_APB5_GRP1_EnableClock\n
  *         MP_APB5ENSETR      STGENC       LL_APB5_GRP1_EnableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB5_GRP1_PERIPH_RTCAPB
  *         @arg @ref LL_APB5_GRP1_PERIPH_TZC
  *         @arg @ref LL_APB5_GRP1_PERIPH_ETZPC
  *         @arg @ref LL_APB5_GRP1_PERIPH_IWDG1
  *         @arg @ref LL_APB5_GRP1_PERIPH_BSEC
  *         @arg @ref LL_APB5_GRP1_PERIPH_STGEN
  * @retval None
  */
__STATIC_INLINE void LL_APB5_GRP1_EnableClock(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  WRITE_REG(RCC->MP_APB5ENSETR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->MP_APB5ENSETR, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Check if APB5 peripheral clock is enabled or not
  * @rmtoll MP_APB5ENSETR      RTCAPB       LL_APB5_GRP1_IsEnabledClock\n
  *         MP_APB5ENSETR      TZC          LL_APB5_GRP1_IsEnabledClock\n
  *         MP_APB5ENSETR      ETZC         LL_APB5_GRP1_IsEnabledClock\n
  *         MP_APB5ENSETR      IWDG1        LL_APB5_GRP1_IsEnabledClock\n
  *         MP_APB5ENSETR      BSEC         LL_APB5_GRP1_IsEnabledClock\n
  *         MP_APB5ENSETR      STGENC       LL_APB5_GRP1_IsEnabledClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB5_GRP1_PERIPH_RTCAPB
  *         @arg @ref LL_APB5_GRP1_PERIPH_TZC
  *         @arg @ref LL_APB5_GRP1_PERIPH_ETZPC
  *         @arg @ref LL_APB5_GRP1_PERIPH_IWDG1
  *         @arg @ref LL_APB5_GRP1_PERIPH_BSEC
  *         @arg @ref LL_APB5_GRP1_PERIPH_STGEN
  * @retval State of Periphs (1 or 0).
  */
__STATIC_INLINE uint32_t LL_APB5_GRP1_IsEnabledClock(uint32_t Periphs)
{
  return ((READ_BIT(RCC->MP_APB5ENSETR, Periphs) == Periphs) ? 1U : 0U);
}

/**
  * @brief  Disable APB5 peripherals clock.
  * @rmtoll MP_APB5ENSETR      RTCAPB       LL_APB5_GRP1_DisableClock\n
  *         MP_APB5ENSETR      TZC          LL_APB5_GRP1_DisableClock\n
  *         MP_APB5ENSETR      ETZC         LL_APB5_GRP1_DisableClock\n
  *         MP_APB5ENSETR      IWDG1        LL_APB5_GRP1_DisableClock\n
  *         MP_APB5ENSETR      BSEC         LL_APB5_GRP1_DisableClock\n
  *         MP_APB5ENSETR      STGENC       LL_APB5_GRP1_DisableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB5_GRP1_PERIPH_RTCAPB
  *         @arg @ref LL_APB5_GRP1_PERIPH_TZC
  *         @arg @ref LL_APB5_GRP1_PERIPH_ETZPC
  *         @arg @ref LL_APB5_GRP1_PERIPH_IWDG1
  *         @arg @ref LL_APB5_GRP1_PERIPH_BSEC
  *         @arg @ref LL_APB5_GRP1_PERIPH_STGEN
  * @retval None
  */
__STATIC_INLINE void LL_APB5_GRP1_DisableClock(uint32_t Periphs)
{
  WRITE_REG(RCC->MP_APB5ENCLRR, Periphs);
}

/**
  * @brief  Force APB5 peripherals reset.
  * @rmtoll MP_APB5LPENSETR    STGENC       LL_APB5_GRP1_ForceReset
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB5_GRP1_PERIPH_ALL
  *         @arg @ref LL_APB5_GRP1_PERIPH_STGEN
  * @retval None
  */
__STATIC_INLINE void LL_APB5_GRP1_ForceReset(uint32_t Periphs)
{
  WRITE_REG(RCC->APB5RSTSETR, Periphs);
}

/**
  * @brief  Release APB5 peripherals reset.
  * @rmtoll MP_APB5LPENSETR    STGENC       LL_APB5_GRP1_ReleaseReset
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB5_GRP1_PERIPH_ALL
  *         @arg @ref LL_APB5_GRP1_PERIPH_STGEN
  * @retval None
  */
__STATIC_INLINE void LL_APB5_GRP1_ReleaseReset(uint32_t Periphs)
{
  WRITE_REG(RCC->APB5RSTCLRR, Periphs);
}

/**
  * @brief  Enable APB5 peripheral clocks in Sleep mode
  * @rmtoll MP_APB5ENSETR      RTCAPB       LL_APB5_GRP1_EnableClockSleep\n
  *         MP_APB5ENSETR      TZC          LL_APB5_GRP1_EnableClockSleep\n
  *         MP_APB5ENSETR      ETZC         LL_APB5_GRP1_EnableClockSleep\n
  *         MP_APB5ENSETR      IWDG1        LL_APB5_GRP1_EnableClockSleep\n
  *         MP_APB5ENSETR      BSEC         LL_APB5_GRP1_EnableClockSleep\n
  *         MP_APB5ENSETR      STGENC       LL_APB5_GRP1_EnableClockSleep\n
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB5_GRP1_PERIPH_RTCAPB
  *         @arg @ref LL_APB5_GRP1_PERIPH_TZC
  *         @arg @ref LL_APB5_GRP1_PERIPH_ETZPC
  *         @arg @ref LL_APB5_GRP1_PERIPH_IWDG1
  *         @arg @ref LL_APB5_GRP1_PERIPH_BSEC
  *         @arg @ref LL_APB5_GRP1_PERIPH_STGEN
  * @retval None
  */
__STATIC_INLINE void LL_APB5_GRP1_EnableClockSleep(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  WRITE_REG(RCC->MP_APB5LPENSETR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->MP_APB5LPENSETR, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Disable APB5 peripheral clocks in Sleep mode
  * @rmtoll MP_APB5ENSETR      RTCAPB       LL_APB5_GRP1_DisableClockSleep\n
  *         MP_APB5ENSETR      TZC          LL_APB5_GRP1_DisableClockSleep\n
  *         MP_APB5ENSETR      ETZC         LL_APB5_GRP1_DisableClockSleep\n
  *         MP_APB5ENSETR      IWDG1        LL_APB5_GRP1_DisableClockSleep\n
  *         MP_APB5ENSETR      BSEC         LL_APB5_GRP1_DisableClockSleep\n
  *         MP_APB5ENSETR      STGENC       LL_APB5_GRP1_DisableClockSleep\n
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB5_GRP1_PERIPH_RTCAPB
  *         @arg @ref LL_APB5_GRP1_PERIPH_TZC
  *         @arg @ref LL_APB5_GRP1_PERIPH_ETZPC
  *         @arg @ref LL_APB5_GRP1_PERIPH_IWDG1
  *         @arg @ref LL_APB5_GRP1_PERIPH_BSEC
  *         @arg @ref LL_APB5_GRP1_PERIPH_STGEN
  * @retval None
  */
__STATIC_INLINE void LL_APB5_GRP1_DisableClockSleep(uint32_t Periphs)
{
  WRITE_REG(RCC->MP_APB5LPENCLRR, Periphs);
}

/**
  * @brief  Enable APB5 peripheral clocks in Stop mode
  * @rmtoll MP_APB5LPENSETR    STGENCSTPEN           LL_APB5_GRP1_EnableClockStop
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB5_GRP1_PERIPH_STGENSTP
  * @retval None
  */
__STATIC_INLINE void LL_APB5_GRP1_EnableClockStop(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  WRITE_REG(RCC->MP_APB5LPENSETR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->MP_APB5LPENSETR, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Disable APB5 peripheral clocks in Stop modes
  * @rmtoll MP_APB5LPENCLRR    STGENCSTPEN          LL_APB5_GRP1_DisableClockStop\n
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB5_GRP1_PERIPH_STGENSTP
  * @retval None
  */
__STATIC_INLINE void LL_APB5_GRP1_DisableClockStop(uint32_t Periphs)
{
  WRITE_REG(RCC->MP_APB5LPENCLRR, Periphs);
}

/**
  * @}
  */

/** @defgroup BUS_LL_EF_APB6 APB6
  * @{
  */

