zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/include/stm32mp13xx_ll_bus.h
/**
  * @brief  Enable APB6 peripherals clock.
  * @rmtoll MP_APB6ENSETR      USART1        LL_APB6_GRP1_EnableClock\n
  *         MP_APB6ENSETR      USART2        LL_APB6_GRP1_EnableClock\n
  *         MP_APB6ENSETR      SPI4          LL_APB6_GRP1_EnableClock\n
  *         MP_APB6ENSETR      SPI5          LL_APB6_GRP1_EnableClock\n
  *         MP_APB6ENSETR      I2C3          LL_APB6_GRP1_EnableClock\n
  *         MP_APB6ENSETR      I2C4          LL_APB6_GRP1_EnableClock\n
  *         MP_APB6ENSETR      I2C5          LL_APB6_GRP1_EnableClock\n
  *         MP_APB6ENSETR      TIM12         LL_APB6_GRP1_EnableClock\n
  *         MP_APB6ENSETR      TIM13         LL_APB6_GRP1_EnableClock\n
  *         MP_APB6ENSETR      TIM14         LL_APB6_GRP1_EnableClock\n
  *         MP_APB6ENSETR      TIM15         LL_APB6_GRP1_EnableClock\n
  *         MP_APB6ENSETR      TIM16         LL_APB6_GRP1_EnableClock\n
  *         MP_APB6ENSETR      TIM17         LL_APB6_GRP1_EnableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB6_GRP1_PERIPH_USART1
  *         @arg @ref LL_APB6_GRP1_PERIPH_USART2
  *         @arg @ref LL_APB6_GRP1_PERIPH_SPI4
  *         @arg @ref LL_APB6_GRP1_PERIPH_SPI5
  *         @arg @ref LL_APB6_GRP1_PERIPH_I2C3
  *         @arg @ref LL_APB6_GRP1_PERIPH_I2C4
  *         @arg @ref LL_APB6_GRP1_PERIPH_I2C5
  *         @arg @ref LL_APB6_GRP1_PERIPH_TIM12
  *         @arg @ref LL_APB6_GRP1_PERIPH_TIM13
  *         @arg @ref LL_APB6_GRP1_PERIPH_TIM14
  *         @arg @ref LL_APB6_GRP1_PERIPH_TIM15
  *         @arg @ref LL_APB6_GRP1_PERIPH_TIM16
  *         @arg @ref LL_APB6_GRP1_PERIPH_TIM17
  * @retval None
  */
__STATIC_INLINE void LL_APB6_GRP1_EnableClock(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  WRITE_REG(RCC->MP_APB6ENSETR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->MP_APB6ENSETR, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Check if APB6 peripheral clock is enabled or not
  * @rmtoll MP_APB6ENSETR      USART1        LL_APB6_GRP1_IsEnabledClock\n
  *         MP_APB6ENSETR      USART2        LL_APB6_GRP1_IsEnabledClock\n
  *         MP_APB6ENSETR      SPI4          LL_APB6_GRP1_IsEnabledClock\n
  *         MP_APB6ENSETR      SPI5          LL_APB6_GRP1_IsEnabledClock\n
  *         MP_APB6ENSETR      I2C3          LL_APB6_GRP1_IsEnabledClock\n
  *         MP_APB6ENSETR      I2C4          LL_APB6_GRP1_IsEnabledClock\n
  *         MP_APB6ENSETR      I2C5          LL_APB6_GRP1_IsEnabledClock\n
  *         MP_APB6ENSETR      TIM12         LL_APB6_GRP1_IsEnabledClock\n
  *         MP_APB6ENSETR      TIM13         LL_APB6_GRP1_IsEnabledClock\n
  *         MP_APB6ENSETR      TIM14         LL_APB6_GRP1_IsEnabledClock\n
  *         MP_APB6ENSETR      TIM15         LL_APB6_GRP1_IsEnabledClock\n
  *         MP_APB6ENSETR      TIM16         LL_APB6_GRP1_IsEnabledClock\n
  *         MP_APB6ENSETR      TIM17         LL_APB6_GRP1_IsEnabledClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB6_GRP1_PERIPH_USART1
  *         @arg @ref LL_APB6_GRP1_PERIPH_USART2
  *         @arg @ref LL_APB6_GRP1_PERIPH_SPI4
  *         @arg @ref LL_APB6_GRP1_PERIPH_SPI5
  *         @arg @ref LL_APB6_GRP1_PERIPH_I2C3
  *         @arg @ref LL_APB6_GRP1_PERIPH_I2C4
  *         @arg @ref LL_APB6_GRP1_PERIPH_I2C5
  *         @arg @ref LL_APB6_GRP1_PERIPH_TIM12
  *         @arg @ref LL_APB6_GRP1_PERIPH_TIM13
  *         @arg @ref LL_APB6_GRP1_PERIPH_TIM14
  *         @arg @ref LL_APB6_GRP1_PERIPH_TIM15
  *         @arg @ref LL_APB6_GRP1_PERIPH_TIM16
  *         @arg @ref LL_APB6_GRP1_PERIPH_TIM17
  * @retval State of Periphs (1 or 0).
  */
__STATIC_INLINE uint32_t LL_APB6_GRP1_IsEnabledClock(uint32_t Periphs)
{
  return ((READ_BIT(RCC->MP_APB6ENSETR, Periphs) == Periphs) ? 1U : 0U);
}

/**
  * @brief  Disable APB6 peripherals clock.
  * @rmtoll MP_APB6ENCLRR      USART1        LL_APB6_GRP1_DisableClock\n
  *         MP_APB6ENCLRR      USART2        LL_APB6_GRP1_DisableClock\n
  *         MP_APB6ENCLRR      SPI4          LL_APB6_GRP1_DisableClock\n
  *         MP_APB6ENCLRR      SPI5          LL_APB6_GRP1_DisableClock\n
  *         MP_APB6ENCLRR      I2C3          LL_APB6_GRP1_DisableClock\n
  *         MP_APB6ENCLRR      I2C4          LL_APB6_GRP1_DisableClock\n
  *         MP_APB6ENCLRR      I2C5          LL_APB6_GRP1_DisableClock\n
  *         MP_APB6ENCLRR      TIM12         LL_APB6_GRP1_DisableClock\n
  *         MP_APB6ENCLRR      TIM13         LL_APB6_GRP1_DisableClock\n
  *         MP_APB6ENCLRR      TIM14         LL_APB6_GRP1_DisableClock\n
  *         MP_APB6ENCLRR      TIM15         LL_APB6_GRP1_DisableClock\n
  *         MP_APB6ENCLRR      TIM16         LL_APB6_GRP1_DisableClock\n
  *         MP_APB6ENCLRR      TIM17         LL_APB6_GRP1_DisableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB6_GRP1_PERIPH_USART1
  *         @arg @ref LL_APB6_GRP1_PERIPH_USART2
  *         @arg @ref LL_APB6_GRP1_PERIPH_SPI4
  *         @arg @ref LL_APB6_GRP1_PERIPH_SPI5
  *         @arg @ref LL_APB6_GRP1_PERIPH_I2C3
  *         @arg @ref LL_APB6_GRP1_PERIPH_I2C4
  *         @arg @ref LL_APB6_GRP1_PERIPH_I2C5
  *         @arg @ref LL_APB6_GRP1_PERIPH_TIM12
  *         @arg @ref LL_APB6_GRP1_PERIPH_TIM13
  *         @arg @ref LL_APB6_GRP1_PERIPH_TIM14
  *         @arg @ref LL_APB6_GRP1_PERIPH_TIM15
  *         @arg @ref LL_APB6_GRP1_PERIPH_TIM16
  *         @arg @ref LL_APB6_GRP1_PERIPH_TIM17
  * @retval None
  */
__STATIC_INLINE void LL_APB6_GRP1_DisableClock(uint32_t Periphs)
{
  WRITE_REG(RCC->MP_APB6ENCLRR, Periphs);
}

/**
  * @brief  Force APB6 peripherals reset.
  * @rmtoll APB6RSTSETR      USART1        LL_APB6_GRP1_ForceReset\n
  *         APB6RSTSETR      USART2        LL_APB6_GRP1_ForceReset\n
  *         APB6RSTSETR      SPI4          LL_APB6_GRP1_ForceReset\n
  *         APB6RSTSETR      SPI5          LL_APB6_GRP1_ForceReset\n
  *         APB6RSTSETR      I2C3          LL_APB6_GRP1_ForceReset\n
  *         APB6RSTSETR      I2C4          LL_APB6_GRP1_ForceReset\n
  *         APB6RSTSETR      I2C5          LL_APB6_GRP1_ForceReset\n
  *         APB6RSTSETR      TIM12         LL_APB6_GRP1_ForceReset\n
  *         APB6RSTSETR      TIM13         LL_APB6_GRP1_ForceReset\n
  *         APB6RSTSETR      TIM14         LL_APB6_GRP1_ForceReset\n
  *         APB6RSTSETR      TIM15         LL_APB6_GRP1_ForceReset\n
  *         APB6RSTSETR      TIM16         LL_APB6_GRP1_ForceReset\n
  *         APB6RSTSETR      TIM17         LL_APB6_GRP1_ForceReset
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB6_GRP1_PERIPH_ALL
  *         @arg @ref LL_APB6_GRP1_PERIPH_USART1
  *         @arg @ref LL_APB6_GRP1_PERIPH_USART2
  *         @arg @ref LL_APB6_GRP1_PERIPH_SPI4
  *         @arg @ref LL_APB6_GRP1_PERIPH_SPI5
  *         @arg @ref LL_APB6_GRP1_PERIPH_I2C3
  *         @arg @ref LL_APB6_GRP1_PERIPH_I2C4
  *         @arg @ref LL_APB6_GRP1_PERIPH_I2C5
  *         @arg @ref LL_APB6_GRP1_PERIPH_TIM12
  *         @arg @ref LL_APB6_GRP1_PERIPH_TIM13
  *         @arg @ref LL_APB6_GRP1_PERIPH_TIM14
  *         @arg @ref LL_APB6_GRP1_PERIPH_TIM15
  *         @arg @ref LL_APB6_GRP1_PERIPH_TIM16
  *         @arg @ref LL_APB6_GRP1_PERIPH_TIM17
  * @retval None
  */
__STATIC_INLINE void LL_APB6_GRP1_ForceReset(uint32_t Periphs)
{
  WRITE_REG(RCC->APB6RSTSETR, Periphs);
}

/**
  * @brief  Release APB6 peripherals reset.
  * @rmtoll APB6RSTCLRR      USART1        LL_APB6_GRP1_ReleaseReset\n
  *         APB6RSTCLRR      USART2        LL_APB6_GRP1_ReleaseReset\n
  *         APB6RSTCLRR      SPI4          LL_APB6_GRP1_ReleaseReset\n
  *         APB6RSTCLRR      SPI5          LL_APB6_GRP1_ReleaseReset\n
  *         APB6RSTCLRR      I2C3          LL_APB6_GRP1_ReleaseReset\n
  *         APB6RSTCLRR      I2C4          LL_APB6_GRP1_ReleaseReset\n
  *         APB6RSTCLRR      I2C5          LL_APB6_GRP1_ReleaseReset\n
  *         APB6RSTCLRR      TIM12         LL_APB6_GRP1_ReleaseReset\n
  *         APB6RSTCLRR      TIM13         LL_APB6_GRP1_ReleaseReset\n
  *         APB6RSTCLRR      TIM14         LL_APB6_GRP1_ReleaseReset\n
  *         APB6RSTCLRR      TIM15         LL_APB6_GRP1_ReleaseReset\n
  *         APB6RSTCLRR      TIM16         LL_APB6_GRP1_ReleaseReset\n
  *         APB6RSTCLRR      TIM17         LL_APB6_GRP1_ReleaseReset
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB6_GRP1_PERIPH_ALL
  *         @arg @ref LL_APB6_GRP1_PERIPH_USART1
  *         @arg @ref LL_APB6_GRP1_PERIPH_USART2
  *         @arg @ref LL_APB6_GRP1_PERIPH_SPI4
  *         @arg @ref LL_APB6_GRP1_PERIPH_SPI5
  *         @arg @ref LL_APB6_GRP1_PERIPH_I2C3
  *         @arg @ref LL_APB6_GRP1_PERIPH_I2C4
  *         @arg @ref LL_APB6_GRP1_PERIPH_I2C5
  *         @arg @ref LL_APB6_GRP1_PERIPH_TIM12
  *         @arg @ref LL_APB6_GRP1_PERIPH_TIM13
  *         @arg @ref LL_APB6_GRP1_PERIPH_TIM14
  *         @arg @ref LL_APB6_GRP1_PERIPH_TIM15
  *         @arg @ref LL_APB6_GRP1_PERIPH_TIM16
  *         @arg @ref LL_APB6_GRP1_PERIPH_TIM17
  * @retval None
  */
__STATIC_INLINE void LL_APB6_GRP1_ReleaseReset(uint32_t Periphs)
{
  WRITE_REG(RCC->APB6RSTCLRR, Periphs);
}

/**
  * @brief  Enable APB6 peripheral clocks in Sleep mode
  * @rmtoll MP_APB6LPENSETR      USART1        LL_APB6_GRP1_EnableClockSleep\n
  *         MP_APB6LPENSETR      USART2        LL_APB6_GRP1_EnableClockSleep\n
  *         MP_APB6LPENSETR      SPI4          LL_APB6_GRP1_EnableClockSleep\n
  *         MP_APB6LPENSETR      SPI5          LL_APB6_GRP1_EnableClockSleep\n
  *         MP_APB6LPENSETR      I2C3          LL_APB6_GRP1_EnableClockSleep\n
  *         MP_APB6LPENSETR      I2C4          LL_APB6_GRP1_EnableClockSleep\n
  *         MP_APB6LPENSETR      I2C5          LL_APB6_GRP1_EnableClockSleep\n
  *         MP_APB6LPENSETR      TIM12         LL_APB6_GRP1_EnableClockSleep\n
  *         MP_APB6LPENSETR      TIM13         LL_APB6_GRP1_EnableClockSleep\n
  *         MP_APB6LPENSETR      TIM14         LL_APB6_GRP1_EnableClockSleep\n
  *         MP_APB6LPENSETR      TIM15         LL_APB6_GRP1_EnableClockSleep\n
  *         MP_APB6LPENSETR      TIM16         LL_APB6_GRP1_EnableClockSleep\n
  *         MP_APB6LPENSETR      TIM17         LL_APB6_GRP1_EnableClockSleep
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB6_GRP1_PERIPH_USART1
  *         @arg @ref LL_APB6_GRP1_PERIPH_USART2
  *         @arg @ref LL_APB6_GRP1_PERIPH_SPI4
  *         @arg @ref LL_APB6_GRP1_PERIPH_SPI5
  *         @arg @ref LL_APB6_GRP1_PERIPH_I2C3
  *         @arg @ref LL_APB6_GRP1_PERIPH_I2C4
  *         @arg @ref LL_APB6_GRP1_PERIPH_I2C5
  *         @arg @ref LL_APB6_GRP1_PERIPH_TIM12
  *         @arg @ref LL_APB6_GRP1_PERIPH_TIM13
  *         @arg @ref LL_APB6_GRP1_PERIPH_TIM14
  *         @arg @ref LL_APB6_GRP1_PERIPH_TIM15
  *         @arg @ref LL_APB6_GRP1_PERIPH_TIM16
  *         @arg @ref LL_APB6_GRP1_PERIPH_TIM17
  * @retval None
  */
__STATIC_INLINE void LL_APB6_GRP1_EnableClockSleep(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  WRITE_REG(RCC->MP_APB6LPENSETR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->MP_APB6LPENSETR, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Disable APB6 peripheral clocks in Sleep mode
  * @rmtoll MP_APB6LPENCLRR      USART1        LL_APB6_GRP1_DisableClockSleep\n
  *         MP_APB6LPENCLRR      USART2        LL_APB6_GRP1_DisableClockSleep\n
  *         MP_APB6LPENCLRR      SPI4          LL_APB6_GRP1_DisableClockSleep\n
  *         MP_APB6LPENCLRR      SPI5          LL_APB6_GRP1_DisableClockSleep\n
  *         MP_APB6LPENCLRR      I2C3          LL_APB6_GRP1_DisableClockSleep\n
  *         MP_APB6LPENCLRR      I2C4          LL_APB6_GRP1_DisableClockSleep\n
  *         MP_APB6LPENCLRR      I2C5          LL_APB6_GRP1_DisableClockSleep\n
  *         MP_APB6LPENCLRR      TIM12         LL_APB6_GRP1_DisableClockSleep\n
  *         MP_APB6LPENCLRR      TIM13         LL_APB6_GRP1_DisableClockSleep\n
  *         MP_APB6LPENCLRR      TIM14         LL_APB6_GRP1_DisableClockSleep\n
  *         MP_APB6LPENCLRR      TIM15         LL_APB6_GRP1_DisableClockSleep\n
  *         MP_APB6LPENCLRR      TIM16         LL_APB6_GRP1_DisableClockSleep\n
  *         MP_APB6LPENCLRR      TIM17         LL_APB6_GRP1_DisableClockSleep
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB6_GRP1_PERIPH_USART1
  *         @arg @ref LL_APB6_GRP1_PERIPH_USART2
  *         @arg @ref LL_APB6_GRP1_PERIPH_SPI4
  *         @arg @ref LL_APB6_GRP1_PERIPH_SPI5
  *         @arg @ref LL_APB6_GRP1_PERIPH_I2C3
  *         @arg @ref LL_APB6_GRP1_PERIPH_I2C4
  *         @arg @ref LL_APB6_GRP1_PERIPH_I2C5
  *         @arg @ref LL_APB6_GRP1_PERIPH_TIM12
  *         @arg @ref LL_APB6_GRP1_PERIPH_TIM13
  *         @arg @ref LL_APB6_GRP1_PERIPH_TIM14
  *         @arg @ref LL_APB6_GRP1_PERIPH_TIM15
  *         @arg @ref LL_APB6_GRP1_PERIPH_TIM16
  *         @arg @ref LL_APB6_GRP1_PERIPH_TIM17
  * @retval None
  */
__STATIC_INLINE void LL_APB6_GRP1_DisableClockSleep(uint32_t Periphs)
{
  WRITE_REG(RCC->MP_APB6LPENCLRR, Periphs);
}

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#endif /* defined(RCC) */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* STM32MP13xx_LL_BUS_H */
